[
    {
        "image": "https://plantvillage-production-new.s3.amazonaws.com/image/2555/file/medium-2af8d7e43adbcf45cb7356141e38c94a.jpg",
        "title": "Apple",
        "description":"An apple is a deciduous tree grown for its fruits, known as apples. Apple fruits are one of the most widely cultivated fruits in the world. They are round (pome) in shape and range in color from green to red. The domestic apple tree is believed to have originated from Western Asia and the Mediterranean, having several wild ancestors. China is the largest producer of apples worldwide. Apple farming can be profitable and rewarding for farmers with suitable land, climate, and markets.",
        "scientific_name": "Malus domestica",
        "common_name:": "Apple tree (En)",
        "uses":"Apples are most commonly eaten fresh but can also be used for baking and cooking. They can be processed into applesauce, cider, vinegar, juice, or butter. Slices can be dried for later consumption. Apples can also be used for the extraction of useful compounds such as fructose and pectin. Apples are rich in fiber, Vitamin C, minerals, and antioxidants. Apples are a great source of soluble fiber, which can help reduce intestinal disorders. They also aid in controlling insulin levels by slowly releasing sugar into the bloodstream. Additionally, apples can lower cholesterol levels and reduce the risk of respiratory diseases. They are also known for their ability to detoxify and cleanse the body. Furthermore, apples have been traditionally used to treat conditions such as fever, dysentery, diarrhea, and constipation.",
        "basic_requirements": "Apple trees grow best in the tropics and at higher latitudes. They require a mild growing season and a cold winter to break their dormancy. In these latitudes, the tree will flower in spring and the fruit will ripen in the fall. In the tropics, the leaves will remain on the tree longer, making it essentially evergreen, and flowering and fruiting will happen sporadically throughout the year unless the tree manages to enforce a uniform cycle across the entire tree by bending shoots to create a wide tree. Apple trees require fertile, well-drained, and well-aerated loamy-sandy soil, with a slightly acidic to alkaline pH of 5.5-6.5. You must test your soil before planting and amend it with organic matter, lime, or sulfur if necessary. Apples require a lot of moisture during the flowering and fruiting stage. Therefore, if you are growing apples in hotter regions, you will need to irrigate your trees. However, keep in mind that excess water around the root zone will encourage disease outbreaks and result in low crop yield. The best method of irrigating apples is through drip irrigation.",
        "growing": "When planted from a seed, an apple tree can take six to ten years to mature and produce fruit of its own. Apple trees are small to medium-sized, reaching heights of 5–10 m (16.4–32.8 ft), with a central trunk that divides into several branches. The leaves of the tree are oval in shape and can reach up to 13 cm (5.1 in) in length and 7 cm (2.8 in) in width. The standard method of propagating apple trees is by budding. When planting an apple nursery or orchard, it is highly advisable to plant seedlings budded from rootstock to prevent an increase in bud dormancy. Budded trees should be pruned in the first year to encourage new shoot growth. ",
        "care": "In the tropics, apple trees require careful management to make heavy crop loads sustainable. This includes bending shoots, pruning the tips, and defoliating the trees. Flowers are also removed to promote growth until the first fruit production, generally after 2 years.",
        "harvesting": "An apple is ready for picking when its background skin color turns from green to yellow. The fruit comes off easily when harvested. Harvesting apples at the right time is key, not only to obtain the highest quality fruit but also to maximize the storage life. Maturation time is dependent on weather conditions during the growing season. Early maturing apples are harvested in August-September. There are several reasons why proper picking technique is important. First, simply pulling apples from the tree with force is likely to bruise the fruit and remove the stems. Apples without stems do not store as well as apples with stems. Second, it is easy to identify apples that have been picked incorrectly. They will have noticeable fingerprint bruises. Make sure to palm instead of grab when picking. Yanking tends to remove spurs from the tree. These fruit spurs represent next year's crop, so by pulling them off, there will be fewer apples to harvest next year. In addition to not pulling the apples from the tree, there are some other actions that are important to avoid. Apples that have touched the ground are a potential source of contamination. Never mix apples from the ground with picked apples. Apples that are decaying or rotten should be dropped on the ground and never placed in your bin. Do not throw or drop apples into your bucket, as this will certainly cause bruising. And always avoid squeezing the fruit when picking.",
        "diseases": [
          {
            "category": "Fungal",
            "name": "Apple__scab",
            "symptoms": "Yellow or chlorotic spots on leaves; dark olive green spots on leaves and fruit; may be a velvety growth on spots on undersides of leaves; twisting of leaves; distorted leaves; severely infected leaves turn yellow and drop from tree.",
            "cause": "Fungus",
            "comments": "Fungus overwinters on dead foliage on ground; spores dispersed by wind; high moisture encourages fungal growth.",
            "treatment": "Remove all leaves dropped from tree in the fall and compost to prevent any diseases surviving in debris; application of zinc and fertilizer grade urea in the Fall may be necessary to speed leaf drop, lime should then be added to fallen leaves; fungicide application may be necessary in areas where leaves remain wet for periods in excess of 9 hours; fungicides such as copper soaps and Bordeaux mixture should be applied if there is a chance of wet period as soon as leaf tips emerge."
          },
          {
            "category": "Fungal",
            "name": "Apple__black_rot",
            "symptoms": "Purple flecks or circular lesions which are brown in the centre and purple at margin; red flecks, purple lesions and/or brown black rings on fruit.",
            "cause": "Fungus",
            "comments": "Spores can overwinter in twigs or fruit remaining on the tree and spread during rainfall.",
            "treatment": "Remove dead wood, mummified fruit and cankers from trees to reduce spread of disease; burn any prunings that have been made from the tree; disease can be controlled by applying fungicides from silver tip to harvest."
          },
          {
            "category": "Fungal",
            "name": "Apple__rust",
            "symptoms": "Bright orange or yellow patches on top side of leaves surrounded by a red band and small black spots in the center; by mid-summer, cup-like structures called aecia form on the leaf undersides; these become covered in tubular structures from which spores are released.",
            "cause": "Fungus",
            "comments": "Fungus requires two hosts to complete lifecycle; forms galls on Eastern red cedar and spores are carried by wind to apple; use caution when planting apple close to red cedar.",
            "treatment":" Plant resistant varieties where possible; remove nearby red cedar; if growing susceptible varieties in proximity to red cedar follow a fungicide program."
          }
        ]
    },
    {
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/6375/file/default-987c49f0f89e47952294a7cd3eaef14a.jpg",
      "title": "Cassava",
      "description":"Cassava is a perennial woody shrub grown for its large, starchy, tuberous roots. Cassava is a major staple food in the developing world, providing a basic diet for over half a billion people. It is one of the most drought-tolerant crops, capable of growing on marginal soils. Nigeria is the world's largest producer of cassava. Cassava is a major source of carbohydrates in tropical regions. The roots are rich in starch and contain small amounts of calcium (16 mg/100 g), phosphorus (27 mg/100 g), and vitamin C (20.6 mg/100 g). Cassava roots are processed into a variety of products such as flour, starch, and chips. The leaves are also edible and are a good source of protein, vitamins, and minerals.",
      "scientific_name": "Manihot esculenta",
      "common_name:": "cassava (En)",
      "basic_requirements": "Cassava grows best in tropical and subtropical regions. It requires a warm, humid climate with temperatures between 25-29°C (77-84°F). Cassava grows best in well-drained, sandy loam soils with a pH of 5.5-6.5. The plant is drought-tolerant and can grow in poor soils with low fertility. Cassava is sensitive to frost and cannot tolerate temperatures below 10°C (50°F).",
      "care": "Cassava is propagated by stem cuttings. The cuttings should be 20-30 cm (8-12 in) long and taken from healthy, disease-free plants. The cuttings should be planted in rows with a spacing of 1 m (3.3 ft) between plants and 1.5 m (5 ft) between rows. Cassava requires regular watering during the growing season. The plant should be fertilized with nitrogen, phosphorus, and potassium to promote growth and yield. Cassava is susceptible to pests and diseases such as mealybugs, spider mites, and cassava mosaic virus. The plant should be monitored regularly for signs of infestation and treated with appropriate pesticides.",
      "uses":  "Cassava is a major source of carbohydrates in tropical regions. The roots are rich in starch and contain small amounts of calcium (16 mg/100 g), phosphorus (27 mg/100 g), and vitamin C (20.6 mg/100 g). Cassava roots are processed into a variety of products such as flour, starch, and chips. The leaves are also edible and are a good source of protein, vitamins, and minerals.",
      "harvesting": "Cassava roots are ready for harvesting 8-12 months after planting. The roots should be harvested when they are mature and the leaves start to turn yellow. The roots should be dug out carefully to avoid damage. The roots should be washed and dried in the sun for 2-3 days. The roots can be stored in a cool, dry place for up to 3 months. Cassava leaves can be harvested throughout the growing season and used as a vegetable.",
      "diseases": [
        {
          "category": "Bacterial",
          "name": "Cassava__bacterial_blight",
          "symptoms": "Water-soaked lesions on leaves; leaf drop; reduced yield.",
          "cause": "Bacteria",
          "comments": "Spread by rain splash; no cure for the disease; plant resistant varieties.",
          "treatment": "Plant resistant varieties; prune infected leaves; apply copper-based fungicides."
        },
        {
          "category": "Fungal",
          "name": "Cassava__brown_streak_disease",
          "symptoms": "Brown spots on leaves; leaf drop; reduced yield.",
          "cause": "Fungus",
          "comments": "Disease emergence favored by high temperature and humidity",
          "treatment": "Remove leaves and crop debris from around plants to prevent disease spreading; remove weeds from around crop"
        },
        {
          "category": "Mites",
          "name": "Cassava__green_mottle",
          "symptoms": "Yellow stipping of leaves; chlorotic spots on leaves; chlorosis of entire leaves; if infestation is very high then leaves may be stunted and deformed; terminal leaves may die and drop from plant; pest responsible is a tiny green mite",
          "cause": "Arachnid",
          "comments": "SGreen spider mites are very common pests in most African growing regions and become problematic during the dry season; can cause significant tuber losses",
          "treatment": "lant tolerant cassava varieties where possible; plant at the beginning of the rainy season to encourage vigorous growth which allows plant to tolerate attack; intercropping with crops such as cowpea may reduce damage; introductions of the predatory mite Typhlodromalus aripo have been very successful at controlling the green spider mite in many regions of Africa"
        },
        {
          "category": "Bacterial",
          "name": "Cassava__mosaic_disease",
          "symptoms": "Discolored pale green, yellow or white mottled leaves which may be distorted with a reduced size; in highly susceptible cassava cultivars plant growth may be stunted, resulting in poor root yield and low quality stem cuttings. Note that infected plants can express a range of symptoms and the exact symptoms depend on the species of virus and the strain as well as the environmental conditions and and the sensitivity of the cassava host.",
          "cause": "Virus",
          "comments": "Disease is spread by infected cuttings and by whiteflies. The leaves are yellow, mottled and distorted. If leaves are yellow all over but are a normal size or there brown leaves that that does not indicate disease. Wild cassava (kisamvu cha mpira in Kiswahili) also hosts the disease. The disease was first observed in the late 19th Century in what is now Tanzania. It was not until work in 1938 that the disease transmission was confirmed to occur via grafting as well as vectored by the White fly.",
          "treatment": "Varieties of cassava resistant to the virus are available in many countries, most traditional varieties of cassava grown in Africa are susceptible to the virus, seek advice from an agricultural extension on suitable varieties for your region (see below). Do not plant cuttings from plants with symptoms of disease; inspect plants regularly for symptoms of disease and remove and destroy any showing symptoms. Infected plants should be uprooted ('rouged'). Replace with disease resistant varieties such as 'Rwizihiza', 'Ndamirabana', 'Cyizere', 'Seruruseke', 'Mavoka', 'Garukunsubire' and 'Mbakungahaze'. There is no agrochemical agent or organic treatment for this disease. There are both control strategies for the whitefly vector."
        }
      ]
    },
    {
     "image": "https://plantvillage-production-new.s3.amazonaws.com/image/2330/file/default-fc30c64c4d1065127d2c62cec3045a16.jpg",
      "title": "Corn", 
      "description":"Corn (Maize) is a staple food for almost half the population of sub-Saharan Africa and is important for its carbohydrate, proteins, iron, vitamin B, and minerals. The produce is consumed as maize meal (ugali), porridge, pastes, and beer, and can be boiled or roasted as fresh as it comes from the farm. Maize is also processed to produce oils for cooking. It is also an important crop for animal feed.",
      "scientific_name": "Zea mays",
      "common_name:": "Corn (Maize)",
      "basic_requirements": "Corn grows best in well-drained, loamy soils with a pH of 5.8-7.0. The plant is sensitive to frost and cannot tolerate temperatures below 10°C (50°F).",
      "care" : "Corn is propagated by seeds. The seeds should be planted in rows with a spacing of 20-30 cm (8-12 in) between plants and 75-90 cm (30-36 in) between rows. Corn requires regular watering during the growing season. The plant should be fertilized with nitrogen, phosphorus, and potassium to promote growth and yield. Corn is susceptible to pests and diseases such as corn earworm, corn borer, and maize streak virus. The plant should be monitored regularly for signs of infestation and treated with appropriate pesticides.",
      "uses": "Corn is a staple food for almost half the population of sub-Saharan Africa and is important for its carbohydrate, proteins, iron, vitamin B, and minerals. The produce is consumed as maize meal (ugali), porridge, pastes, and beer, and can be boiled or roasted as fresh as it comes from the farm. Maize is also processed to produce oils for cooking. It is also an important crop for animal feed.",
      "harvesting": "Corn is ready for harvesting 3-4 months after planting. The ears should be harvested when they are mature and the kernels are fully developed. The ears should be picked by hand and the husks removed. The ears should be dried in the sun for 2-3 days and stored in a cool, dry place. The kernels can be removed from the ears and stored in airtight containers for up to 6 months.",
      "diseases":[
        {
          "category": "Fungal",
          "name": "Corn__common_rust",
          "symptoms": "Oval or elongated cinnamon brown pustules on upper and lower surfaces of leaves; pustules rupture and release powdery red spores; pustules turn dark brown-black as they mature and release dark brown powdery spores; if infection is severe, pustules may appear on tassels and ears and leaves may begin to yellow; in partially resistant corn hybrids, symptoms appear as chlorotic or necrotic flecks on the leaves which release little or no spore.",
          "cause": "Fungus",
          "comments": "Disease is spread by wind-borne spores; some of the most popularly grown sweet corn varieties have little or no resistance to the disease.",
          "treatment":"The most effective method of controlling the disease is to plant resistant hybrids; application of appropriate fungicides may provide some degree on control and reduce disease severity; fungicides are most effective when the amount of secondary inoculum is still low, generally when plants only have a few rust pustules per leaf."
        },
      {
        "name": "Corn__gray_leaf_spot",
        "category": "Fungal",
        "symptoms": "Small, rectangular, gray to brown lesions with dark borders on leaves; lesions may coalesce to form larger necrotic areas; lesions may have a yellow halo; lesions may be surrounded by a yellow border; lesions may be found on leaf tips, margins, and between veins; lesions may be found on both upper and lower leaf surfaces.",
        "cause": "Fungus",
        "comments": "Disease emergence favored by high humidity and moderate temperatures; disease is spread by wind-borne spores.",
        "treatment": "Plant resistant hybrids where possible; apply appropriate fungicides when disease is first observed; remove and destroy infected leaves; practice crop rotation."
      }
      ]
    },
    {
      "image":"https://plantvillage-production-new.s3.amazonaws.com/image/72/file/default-fdd003aeadf7596eca86fa590724a359.jpg",
      "title": "Grape",
      "description":"The Common or European grapevine (Vitis vinifera) is a long stemmed, woody vine (liana) which produces high value berries, or grapes. The vines can reach lengths in excess of 30 m and can live for many years with proper management. The leaves of the grape vine are alternately arranged on the stem and are long and broad with 5–7 lobes, typically reaching sizes of 5–20 cm (2.0–7.9 in). Flowers are produced in clusters and fruit. The fruit is a berry known as a grape and grows in clusters from the vine. In wild species, the fruit is 6 mm (1/5 in) in diameter and ripens to dark purple to black with a pale wax bloom. In cultivated plants, the berry is usually much larger, up to 3 cm (1.2 in) long and can be green, red or purple. Vitis vinifera is native to the Mediterranean region, central Europe, and southwestern Asia but is cultivated on every continent except Antarctica.",
      "scientific_name": "Vitis vinifera",
      "common_name:": "Grape vine (En)",
      "basic_requirements": "Grape vines grow best in temperate regions with warm, dry summers and mild winters. The plant requires full sun and well-drained, sandy loam soils with a pH of 6.0-6.5. The plant is sensitive to frost and cannot tolerate temperatures below -15°C (5°F).",
      "uses":"Grapes are the most widely produced commercial fruit crop in the world. They are often eaten fresh but are also commonly used to produce wine. Grapes can also be processed into jams, and preserves, juices, grape seed oil, grape seed extract, raisins and vinegar",
      "care": "Grape vines are propagated by cuttings. The cuttings should be 20-30 cm (8-12 in) long and taken from healthy, disease-free plants. The cuttings should be planted in rows with a spacing of 1 m (3.3 ft) between plants and 2 m (6.6 ft) between rows. Grape vines require regular watering during the growing season. The plant should be fertilized with nitrogen, phosphorus, and potassium to promote growth and yield. Grape vines are susceptible to pests and diseases such as powdery mildew, downy mildew, and grapevine leafroll virus. The plant should be monitored regularly for signs of infestation and treated with appropriate pesticides.",
      "harvesting": "Grapes are ready for harvesting 3-4 months after flowering. The berries should be harvested when they are mature and the skin is soft. The berries should be picked by hand and the stems removed. The berries should be washed and dried in the sun for 2-3 days. The berries can be stored in a cool, dry place for up to 2 weeks. Grapes can be eaten fresh or used to produce wine.",
      "diseases":[
        {
          "name": "Grape__black_measles",
          "category": "Fungal",
          "casue": "Fungus",
          "symptoms": "Symptom appears on leaves, trunk, canes and berries. On leaves we will see intervenaial striping looks like tiger strips. White cultivars shows chlorotic and necrotic strips where as red cultivars shows red areas and necrotic strips. On berries we will see superficial spots and later may coalesce making berries appear black. Trunk/arm/cordons shows dark brown black vascular streaking and oozes dark sap when we cut trunk. Some time this measles in associate with numerous secondary wood rotting fungi which decorate the vineyard completely.",
          "comments" : "The leaf and berry symptoms may occur together in single cane or may show symptom on only one parts. The severe infestation of measles kill grapevine in a single year which is commonly called apoplexy. The symptoms are common in 5 to 7 year old vineyard. The prune wounds helps in pathogen entrance and establishment",
          "treatment": "Till date there is no effective method to control this disease. Remove the infected berries, leaves and trunk and destroy them. Protect the prune wounds to minimize fungal infection using wound sealant (5% boric acid in acrylic paint) or essential oil or suitable fungicides."
        },
        {
          "name": "Grape__black_rot",
          "category": "Fungal",
          "cause": "Fungus",
          "symptoms": "Brown lesions on the leaves that develop black dots (pycnidia); grapes have light spots that eventually form pycnidia; grapes harden and turn black, while still remaining on the vine ",
          "comments": "Disease favors rainy weather; spores may ooze out during rain",
          "treatment": "Remove all mummified fruit from vines during dormant pruning; cultivate soil during bud break to bury mummies and reduce inoculant; application of appropriate fungicides can help control the disease"
        },
        {
          "name": "Grape__leaf_blight_(isariopsis_leaf_spot)",
          "casue":"Fungus",
          "category": "Fungal",
          "symptoms": "On leaf surface we will see lesions which are irregularly shaped (2 to 25 mm in diameter). Initially lesions are dull red to brown in color turn black later. If disease is severe this lesions may coalesce. On berries we can see symptom similar to black rot but the entire clusters will collapse.",
          "comments": "Common in tropical and subtropical grapes. The disease appear late in the season. Cynthiana and Cabernet Sauvignon are susceptible to this pathogen.",
          "treatment": " Fungicides sprayed for other diseases in the season may help to reduce this disease."
        }
      ]
    },
    {
      "image":"https://plantvillage-production-new.s3.amazonaws.com/image/95/file/default-41e046bff0e72cb92ea6cbdead09f928.jpg",
      "title": "Peach",
      "description": "Peach, Prunus persica, is a deciduous tree or shrub in the family Rosaceae grown for its edible fruit of the same name. The peach tree is relatively short with slender and and supple branches. The leaves are alternately arranged, slender and pointed. The tree produces pink flowers which have five petals and emerge in January and February. The fruit is a velvety, soft, fleshy red to yellow-orange fruit which is oval in shape and 3-8 cm in diameter. Peach trees can grow up to 8 m (19 ft) in height and produce fruit for 10 to 20 years. Peach may also be referred to as nectarine, the two fruits belonging to the same species, although nectarines have smooth skin, and are believed to have originated in China.",
      "scientific_name": "Prunus persica",
      "common_name:": "Peach tree (En)",
      "basic_requirements": "Peaches grow best in areas with warm summers and require a summer temperature between 20 and 30°C (68-86°F) for the fruit to mature. The trees also have a chilling requirement to break dormancy but fruit buds can be damaged by prolonged periods below -15°C (5°F) and as such, the majority of production takes place in countries which are relatively close to the equator. In addition, peach trees bloom early and can be damaged by late frosts. Trees grow best in well-draining sandy loams in areas that receive full sun but can will grow in a variety of soils as long as water does not sit on the surface after heavy rainfall. It can be beneficial to plant the trees on elevated land to allow cold air to drain away",
      "uses": "The leaves of the peach tree are used in herbal teas and the wood is used in furniture making.",
      "care":" Peaches should be pruned annually, including the year of planting and are best trained to an open center. When the tree is bearing fruit, it is important to thin the fruits to prevent the tree from over-bearing. Aim to have 1 fruit every 8 inches. This allows fruits to become larger and prevents the tree from reducing production the following year.",
      "harvesting": "Peaches are ready for harvesting in the summer months, usually between June and August. The fruit should be picked when it is fully ripe and the skin is soft. The fruit should be picked by hand and the stem removed. The fruit should be washed and dried in the sun for 2-3 days. The fruit can be stored in a cool, dry place for up to 1 week. Peaches can be eaten fresh or used to make jams, jellies, and pies.",
      "diseases": [
        {
          "name": "Peach__bacterial_spot",
          "symptoms": "Water soaked, angular gray lesions on the underside of the leaves which turn purple and necrotic in the center and cause a shot hole appearance if lesion center drops out; if lesions are present in high numbers on leaves they may become chlorotic and drop from tree; cankers develop on twigs either as raised blisters or as a dark area surrounding a bud that fails to open; in years of severe infection the entire fruit crop may be lost; lesions on fruit begin as small brown, water-soaked lesions which may exude gum",
          "cause": "Bacteria",
          "category": "Bacterial",
          "comments": "Periods of frequent rainfall during late bloom and early petal drop increase likelihood of fruit and leaf infection; infection is rare during hot, dry weather",
          "treatment": "Avoid planting susceptible peach varieties in areas where disease is known; once disease is visible it can be difficult to control, protective copper applications in the Fall prior to leaf drop and/or application in early growing season may help prevent the disease; care should be taken as peach trees are very sensitive to copper"
        }
      ]
    },
    {
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/2243/file/default-b8a1275bf94a5866ef6369a8ca845694.jpg",
      "title": "Peaper, Bell",
      "description": "Bell peppers, Capsicum annuum are a cultivar group of annual or perennial plants in the family Solanaceae grown for their edible fruits. Bell pepper plants are short bushes with woody stems that grow brightly colored fruits. The alternating leaves are elliptical, smooth edged, and come to a distinct point. The plant produces white or purple bell-shaped flowers which are 2.5 cm (1 in) in diameter. Red, yellow, purple, or brown fruit are produced each season about 3-6 weeks after flowering. Pepper plants can grow 1 m (3.3 ft) tall and are usually grown as annuals in temperate regions for only one growing season. Bell pepper may be referred to as red pepper, yellow pepper or green pepper and is believed to have originated in Central and South America.",
      "scientific_name": "Capsicum annuum",
      "common_name:": "Bell pepper (En)",
      "basic_requirements": "Bell peppers are warm-season crops and grow best at temperatures between 18 and 30°C (65–86°F). They can be grown in many soil types although sandy soils warm faster in Spring and are good for early planting. The soil should have a pH between 6 and 7. Peppers will not tolerate water saturated soil and should be planted in a well draining soil or raised bed. Peppers should be planted in an area that receives full sun for most of the day",
      "care": "Peppers will benefit from applications of fertilizer to keep them supplied with essential nutrients. A timed release fertilizer can be applied at bloom or the plants can be fed with a liquid fertilizer at planting and every two weeks thereafter. In addition, pepper plants can produce a heavy load of fruit and it can be helpful to provide the plants with some support using stakes or cages to prevent branches from breaking under the weight. Use a soft material to tie plants to stakes or cages.",
      "uses": "Bell peppers are used in a variety of culinary dishes and are often eaten raw or cooked. They can be stuffed, roasted, grilled, or used in salads, soups, and stews. Bell peppers are a good source of vitamins A and C and are low in calories.",
      "growing": "",
      "harvesting": "Bell peppers are ready for harvesting 2-3 months after planting. The fruit should be picked when it is fully ripe and the skin is firm. The fruit should be picked by hand and the stem removed. The fruit should be washed and dried in the sun for 2-3 days. The fruit can be stored in a cool, dry place for up to 1 week. Bell peppers can be eaten raw or used in a variety of culinary dishes.",
      "diseases": [
        {
          "name": "Pepper__bacterial_spot",
          "category": "Bacterial",
          "casue": "Bacteria",
          "symptoms": "Water-soaked lesions that dry out and turn brown forming on the underside of the leaves; raised brown cankers on stems; cracked brown lesions on fruit.",
          "comments": "Disease emergence favored by warm, wet conditions; the pathogen can be enter a field on seed and transplants and can be spread within a field by wind-driven rain, clipping plants and aerosols.",
          "treatment": " Use disease free planting material; remove and destroy all crop debris after harvest, or plow material deeply under soil. "
        }
      ]
    },
    {
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/4702/file/default-2f41fcbfca98f989dde66255d80839c5.jpg",
      "title": "Pomegranate",
      "description": "Pomegranate, Punica granatum, is a deciduous or evergreen tree or shrub in the family Punicaceae grown for its edible fruits. The pomegranate tree is branched and spiny with glossy, leathery, oval to oblong leaves that grow in whorls of five or more on the branches. The tree produces bright red flowers singly at the tips of the branches and a rounded hexagonal fruit with a thick pink-red skin. The fruit has a thick, leathery rind which protects the pulp[ and seeds inside. The inside of the fruit is separated into compartments by white spongy tissue. Each compartment contains seeds and pulp. Each pomegranate fruit may contain as many as 600 seeds. Pomegranate trees can reach a height of 10 m (33 ft) and can be very long lived, although their economic lifespan is usually between 12 and 15 years. Pomegranate may also be referred to as grenadine or Chinese apple and originated from Central Asia, likely in Iran. ",
      "scientific_name": "Punica granatum",
      "common_name:": "Pomegranate (En)",
      "basic_requirements": "Pomegranates grow best in temperate or semi-arid climates with a cool winter and warm summer. They are less hardy than many other deciduous fruit trees but more hardy than citrus. Pomegranates will suffer severe damage when temperatures drop below -10°C (14°F).",
      "harvesting": "Pomegranate fruits are generally ready to harvest between 6 and 7 months after flowering, fruits should be allowed to mature fully on the branch prior to harvest as they will not continue to ripen off of the tree. Fully mature fruit turn bright red in color and make a metallic sound when tapped. Fruits should be harvested by cutting from the tree.",
      "care": "Pomegranates have a similar water requirement to citrus trees and should be provided with additional irrigation during dry periods. Pomegranate orchards usually utilize drip, furrow or sprinkler irrigation systems to promote optimal yields. Pomegranates can be pruned to a single stemmed tree or allowed to grow as a multi-stemmed bush. Suckers should be removed from around the central trunks as they develop. ",
      "uses": "",
      "diseases": [
        {
          "name": "Pomegranate__diseased",
          "category": "Bacterial",
          "cause": "Bacteria",
          "symptoms": "Light brown spots on leaves and fruit which enlarge and coalesce to form large black patches on fruit; black elliptical spots appear on twigs and become flattened and depressed with a raised margin; infected twigs dry out and die; infection may cause plant death.",
          "comments": "Disease emergence is favored by rainfall and water saturated soil.",
          "treatment": "Diseased fruits should be removed and destroyed; infected twigs and branches should be pruned out; applications of appropriate fungicides can help to control the disease."
        }
      ]
    },
    {
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/2630/file/default-00449c901523ff06fad38c7c309c6e02.jpg",
      "title": "Potato",
      "description":"The potato (Solanum tuberosum) is a widely cultivated root vegetable in the Solanaceae family. They are native to the Andes Mountains in South America and have been grown for thousands of years. Potatoes are a staple food in many countries around the world and are used in a wide variety of dishes. They are high in carbohydrates, fiber, and vitamins C and B6.",
      "scientific_name": "Solanum tuberosum",
      "common_name:": "Potato (En)",
      "uses": "Potato tubers are a staple food source in temperate regions and are eaten after cooking. They may be cut or sliced and made into potato chips or fries. Potatoes can also be processed into starch, alcohol or flour.",
      "basic_requirements": "Potatoes grow best in cool, temperate climates with temperatures between 15-20°C (59-68°F). The plant requires full sun and well-drained, sandy loam soils with a pH of 5.0-6.0. The plant is sensitive to frost and cannot tolerate temperatures below -2°C (28°F).",
      "care": "Potatoes are propagated by tubers. The tubers should be planted in rows with a spacing of 30-40 cm (12-16 in) between plants and 75-90 cm (30-36 in) between rows. Potatoes require regular watering during the growing season. The plant should be fertilized with nitrogen, phosphorus, and potassium to promote growth and yield. Potatoes are susceptible to pests and diseases such as potato blight, potato cyst nematode, and potato virus Y. The plant should be monitored regularly for signs of infestation and treated with appropriate pesticides.",
      "harvesting": "Harvesting potatoes is the process of collecting the tubers, which are the edible part of the potato plant, from the soil. The timing of the harvest is crucial and will depend on the variety of potato being grown. Generally, potatoes are ready to be harvested when the foliage has died back and the skin of the tubers has hardened.",
      "diseases":[
        {
          "name": "Potato__early_blight",
          "category": "Fungal",
          "cause": "Fungus",
          "symptoms": "Brown spots with a target-like appearance on leaves; spots may have a yellow halo; spots may merge to form large necrotic areas; leaves may become distorted and drop from plant.",
          "comments": "Disease emergence favored by warm, wet conditions; spores may be spread by wind, rain, or irrigation.",
          "treatment": "Remove and destroy infected leaves; apply appropriate fungicides when disease is first observed; practice crop rotation."
        },
        {
          "name": "Potato__late_blight",
          "category": "Fungal",
          "cause": "Fungus",
          "symptoms": "Water-soaked lesions on leaves; lesions may have a white moldy growth on the underside of the leaf; lesions may be surrounded by a yellow halo; lesions may be found on stems and fruit.",
          "comments": "Disease emergence favored by cool, wet conditions; spores may be spread by wind, rain, or irrigation.",
          "treatment": "Remove and destroy infected leaves; apply appropriate fungicides when disease is first observed; practice crop rotation."
        }
      ]
    },
    {
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/2640/file/default-65bfe2020b8d74ed791e40d09d026d4b.jpg",
      "title": "strawberry",
      "description" : "Strawberry is the name given to several plant species in the genus Fragaria, including Fragaria vesca (wild strawberry), Fragaria grandiflora, Fragaria magna, Fragaria chiloensis and Fragaria ananassa (or Fragaria x ananassa) which are grown for their edible fruit. Strawberry is an herbaceous perennial in the family Rosaceae. The plant has a short stem and trifoliate leaves which form a crown. close to the ground. The leaves display a variety of characteristic depending on the species, some are evergreen whereas some have leaves that will die and fall off in winter. The plant produces flower stalks from the crown and the the flowers are white in color. The fruit of the plant is red and fleshy with small seeds on the outside. Strawberry can grow 20–25 cm (8–10 in) in height and has an economic life of 2–4 years before the plants are replaced. Strawberry may also be referred to as garden strawberry and the plant is grown in most northern temperate regions of the world. The first domestic hybrids were created in Europe. ",
      "scientific_name": "Fragaria x ananassa",
      "common_name:": "Strawberry (En)",
      "basic_requirements": " Strawberries grow very well in cool temperate climates, at temperatures below 30°C (86°F)and require at least 8 hours of sunlight per day. They can be grown successfully in a wide variety of soils from sandy soils to silty clay but will grow best in a deep, well draining loam rich in organic matter. The optimum pH for their growth is between 5.5 and 6.5. If drainage is poor then it is recommended to plant strawberry on beds raised by a minimum of 15–20 cm (6–8 in).",
      "care": "In the first growing season after planting, the plants should not be allowed to produce fruit in order for the plants to concentrate their energy of vegetative growth. Pinch off any flowers as they are produced. Fruit can be harvested in the year after planting. When the desired density of plants is reached cut off any runners or cultivate with a hoe. Weeds should also be removed from the strawberry bed regularly. Strawberry plants also require adequate moisture and should receive 2.5–3.8 cm (1–1.5 in) of water per week either from rainfall or irrigation if needed. Strawberries will benefit from the addition of mulch which helps to conserve soil moisture and protects the plants from late frosts in Spring. If frost is forecast after planting the plants should be protected with row covers or other suitable material. ",
      "uses": "Strawberries are eaten fresh or used in a variety of culinary dishes such as jams, jellies, pies, and ice cream. They are also used to make juices, syrups, and wines.",
      "harvesting": "Fruit should be harvested regularly (every other day) when it is being produced by picking the berry along with the cap and 0.5 in of stem. remove the berries by pinching the stem. Harvest only fully ripe strawberries as they will not ripen further after harvest.",
      "diseases": [
        {
          "name": "Strawberry___leaf_scorch",
          "category": "Fungal",
          "cause": "Fungus",
          "symptoms": "Irregular dark purple or brown blotches on upper leaf surface which may colaesce to produce large purplish brown patches; tissue between blotches may turn purple or red; lesions may also develop on flowers and fruits; affected petals may wither and drop from plant; lesions may girdle peduncles causing death of fruit.",
          "comments": "Disease emergence favored by wet foliage for extended periods of time.",
          "treatment": "Plant resistant varieties; regular renewal of plants; plant in an area with good air circulation and drainage in full sun; remove all foliage from plants at harvest; application of appropriate foliar fungicide may be required to provide control."
        }
      ]
    },
    {
     "image": "https://plantvillage-production-new.s3.amazonaws.com/image/3809/file/default-66f3f62ca34234338b8e8bc5d7c63c30.jpg",
     "title": "Tomato",
     "scientific_name": "Lycopersicon esculentum",
      "common_name:": "Tomato (En)",
      "uses": "Tomato fruit can be eaten raw or cooked and is used in many dishes. The fruit may also be processed into juice, soup, ketchup, puree, paste or powder.",
      "description": "Tomato is an herbaceous annual in the family Solanaceae grown for its edible fruit. The plant can be erect with short stems or vine-like with long, spreading stems.",
      "care":  "",
      "basic_requirements": "Tomatoes grow best in warm, sunny climates with temperatures between 20-30°C (68-86°F). The plant requires full sun and well-drained, sandy loam soils with a pH of 6.0-6.8. The plant is sensitive to frost and cannot tolerate temperatures below 10°C (50°F).",
      "harvesting" :"Tomatoes are ready for harvesting 2-3 months after planting. The fruit should be picked when it is fully ripe and the skin is firm. The fruit should be picked by hand and the stem removed. The fruit should be washed and dried in the sun for 2-3 days. The fruit can be stored in a cool, dry place for up to 1 week. Tomatoes can be eaten raw or used in a variety of culinary dishes.",
      "diseases": [
        {
          "name": "Tomato__bacterial_spot",
          "category": "Bacterial",
          "cause": "Bacteria",
          "symptoms": "Bacterial spot lesions starts out as small water-soaked spots; lesions become more numerous and coalesce to form necrotic areas on the leaves giving them a blighted appearance; of leaves drop from the plant severe defoliation can occur leaving the fruit susceptible to sunscald; mature spots have a greasy appearance and may appear transparent when held up to light; centers of lesions dry up and fall out of the leaf; blighted leaves often remain attached to the plant and give it a blighted appearance; fruit infections start as a slightly raised blister; lesions may have a faint halo which eventually disappears; lesions on fruit may have a raised margin and sunken center which gives the fruit a scabby appearance.",
          "comments": "Bacteria survive on crop debris; disease emergence favored by warm temperatures and wet weather; symptoms are very similar to other tomato diseases but only bacterial spot will cause a cut leaf to ooze bacterial exudate; the disease is spread by infected seed, wind-driven rain, diseased transplants, or infested soil; bacteria enter the plant through any natural openings on the leaves or any openings caused by injury to the leaves.",
          "treatment": "Use only certified seed and healthy transplants; remove all crop debris from planting area; do not use sprinkler irrigation, instead water from base of plant; rotate crops."
        }, 
        {
          "name": "Tomato__early_blight",
          "category": "Fungal",
          "cause": "Fungus",
          "symptoms": "Early blight symptoms start as oval shaped lesions with a yellow chlorotic region across the lesion; concentric leaf lesions may be seen on infected leaves; leaf tissue between veins is destroyed; severe infections can cause leaves to completely collapse; as the disease progresses leaves become severely blighted leading to reduced yield; tomato stems may become infected with the fungus leading to Alternaria stem canker; initial symptoms of of stem canker are the development of dark brown regions on the stem; stem cankers may enlarge to girdle the whole stem resulting in the death of the whole plant; brown streaks can be found in the vascular tissue above and below the canker region; fruit symptoms include small black v-shaped lesions at the shoulders of the fruit (the disease is also known black shoulder); lesions may also appear on the fruit as dark flecks with concentric ring pattern; fruit lesions can seen in the field or may develop during fruit transit to the market; the lesions may have a velvety appearance caused by sporulation of the fungus",
        "comments": "Disease can spread rapidly after plants have set fruit; movement of air-borne spores and contact with infested soil are causes for the spread of the disease",
        "treatment": "Apply appropriate fungicide at first sign of disease; destroy any volunteer solanaceous plants (tomato, potato, nightshade etc); practice crop rotation"

        },
        {
          "name": "Tomato__late_blight",
          "category": "Fungal",
          "cause": "Fungus",
          "symptoms": "Late blight affects all aerial parts of the tomato plant; initial symptoms of the disease appear as water-soaked green to black areas on leaves which rapidly change to brown lesions; fluffy white fungal growth may appear on infected areas and leaf undersides during wet weather; as the disease progresses, foliage becomes becomes shriveled and brown and the entire plant may die; fruit lesions start as irregularly shaped water soaked regions and change to greasy spots; entire fruit may become infected and a white fuzzy growth may appear during wet weather.",
          "comments": "Can devastate tomato plantings.",
          "treatment": "Plant resistant varieties; if signs of disease are present or if rainy conditions are likely or if using overhead irrigation appropriate fungicides should be applied."
        },
        {
          "name": "Tomato__leaf_mold",
          "category": "Fungal",
          "cause": "Fungus",
          "symptoms": "The older leaves exhibit pale greenish to yellow spots (without distinguishable margins) on upper surface. Whereas the lower portion of this spots exhibit green to brown velvety fungal growth. As the disease progress the spots may coalesce and appear brown. The infected leaves become wither and die but stay attached to the plant. The fungus also infects flowers and fruits. The affected flowers become black and drop off. The affected fruit intially shows smooth black irregular area on the stem end but later it becomes sunken, leathery and dry.",
          "comments": "The disease is favored by high relative humidity. Also a common disease in green house tomato crop.",
          "treatment":"Grow available resistant varieties. Avoid leaf wetting and overhead application of water. Follow proper spacing to provide good air circulation around the plants. Remove the infected plant debris and burn them. If the disease is severe scary suitable fungicide."
        },
        {
          "name": "Tomato__mosaic_virus",
          "category": "Viral",
          "cause": "Virus",
          "symptoms":"Symptoms can occur at any growth stage and any part of the plant can be affected; infected leaves generally exhibit a dark green mottling or mosaic; some strains of the virus can cause yellow mottling on the leaves; young leaves may be stunted or distorted; severely infected leaves may have raised green areas; fruit yields are reduced in infected plants; green fruit may have yellow blotches or necrotic spots; dark necrotic streaks may appear on the stems, petioles leaves and fruit.",
          "comments": "ToMV is a closely related strain of Tobacco mosaic virus (TMV), it enters fields via infected weeds, peppers or potato plants; the virus may also be transmitted to tomato fields by grasshoppers, small mammals and birds.",
          "treatment": "Plant varieties that are resistant to the virus; heat treating seeds at 70°C (158°F) for 4 days or at 82–85°C (179.6–185°F) for 24 hours will help to eliminate any virus particles on the surface of the seeds; soaking seed for 15 min in 100 g/l of tri-sodium phosphate solution (TSP) can also eliminate virus particles - seeds should be rinsed thoroughly and laid out to dry after this treatment; if the virus is confirmed in the field, infected plants should be removed and destroyed to limit further spread; plant tomato on a 2-year rotation, avoiding susceptible crops such as peppers, eggplant, cucurbits and tobacco; disinfect all equipment when moving from infected areas of the field."
        },
        {
          "name": "Tomato__septoria_leaf_spot",
          "symptoms": "Symptoms may occur at any stage of tomato development and begin as small, water-soaked spots or circular grayish-white spots on the underside of older leaves; spots have a grayish center and a dark margin and they may colasece; fungal fruiting bodies are visible as tiny black specks in the center of spot; spots may also appear on stems, fruit calyxes, and flowers.",
          "cause": "Fungus",
          "category": "Fungal",
          "comments": "Spread by water splash; fungus overwinters in plant debris.",
          "treatment": " Ensure all tomato crop debris is removed and destroyed in Fall or plowed deep into soil; plant only disease-free material; avoid overhead irrigation; stake plants to increase air circulation through the foliage; apply appropriate fungicide if necessary."
        },
        {
          "name":"Tomato__spider_mites_(two_spotted_spider_mite)",
          "category": "Insect",
          "cause": "Mite",
          "symptoms": "Leaves stippled with yellow; leaves may appear bronzed; webbing covering leaves; mites may be visible as tiny moving dots on the webs or underside of leaves, best viewed using a hand lens; usually not spotted until there are visible symptoms on the plant; leaves turn yellow and may drop from plant.",
          "comments": "Spider mites thrive in dusty conditions; water-stressed plants are more susceptible to attack.",
          "treatment": "In the home garden, spraying plants with a strong jet of water can help reduce buildup of spider mite populations; if mites become problematic apply insecticidal soap to plants; certain chemical insecticides may actually increase mite populations by killing off natural enemies and promoting mite reproduction."
        },
        {
          "name": "Tomato__target_spot",
          "category": "Fungal",
          "cause": "Fungus",
          "symptoms": "The fungus infects all parts of plant. Infected leaves shows small, pinpoint, water soaked spots initially. As the disease progress the spots enlarge to become necrotic lesions with conspicuous concentric circles, dark margins and light brown centers. Whereas the fruits exhibit brown, slightly sunken flecks in the beginning but later the lesions become large pitted appearance.",
          "comments":"The pathogen infects cucumber, pawpaw , ornamental plants, some weed species etc. The damaged fruits are susceptible for this disease.",
          "treatment": "Remove the plant debris and burn them. Avoid over application of nitrogen fertilizer. If the disease is severe spray suitable fungicides."
        },
        {
          "name": "Tomato__yellow_leaf_curl_virus",
          "category": "Viral",
          "symptoms":"The infected leaves become reduced in size, curl upward, appear crumpled and show yellowing of veins and leaf margins. The internodes become shorter and whole plant appear stunted and bushy. The whole plant stand erect with only upright growth. The flowers may not develop and drop off.",
          "cause": "Virus",
          "comments": "The virus is transmitted by white flies and may cause 100 % yield loss if the plants infect at early stage of crop. The virus also infect other hosts like common bean, ornamental plants and several weed species.",
          "treatment": "Grow available resistant varieties. Transplant only disease and whiteflies free seedlings. Remove the infected plants and burn them. Keep the field free from weeds. Use yellow sticky traps to monitor and control whiteflies. If the insect infestation is severe spray suitable insecticides."

        }
      ]
    },
    {
      "title": "African Eggplant" ,
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/6382/file/default-be05ac274c8fe4b9fc4ffea3ee496d72.jpg",
      "description": "African eggplant, Solanum aethiopicum, is a perennial plant in the family Solanaceae grown for its edible fruit. The plant is erect with branching and can grow to 2 m (6.6 ft) in height. The leaves are lobed and the flowers are white to purple in color. The fruit is a round or oval berry which is green when immature and turns yellow, orange or red when ripe. The fruit is 2-10 cm (0.8-4 in) in diameter and contains numerous seeds. African eggplant is grown in tropical and subtropical regions of the world and is believed to have originated in Africa.",
      "scientific_name": "Solanum aethiopicum",
      "common_name:": "african scarlet eggplant, bitter tomato",
      "uses": "African eggplant is grown primarily for its bitter orange-red fruit, which may be eaten boiled, steamed, pickled or in stews with meat and other vegetables. Young leaves are also often used in soups. African eggplants are a source of fiber, potassium, and offer traces of beta-carotene, ascorbic acid, iron, and calcium.",
      "basic_requirements": "Growth requirements for African eggplant vary with variety. All types grow best in full sun and well-draining, deep soils with a pH between 5.5 and 6.8. Gilo types grow best at daytime temperatures between 25 and 35°C (77 and 95°F). Kumba types can grow in hotter temperatures of up to 45°C in low humidity, whereas Shum types require warm and humid conditions in order to thrive. No varieties of African eggplant tolerate very cold or water-logged conditions.",
      "growing": "African eggplant seeds can be collected from fully ripe fruits. Once the seeds have been extracted, they should be laid out on a piece of paper to dry in a place where they are not exposed to direct sunlight. Once dry, seeds can be stored for many years and still remain viable. Seeds should be planted in a prepared nursery bed and should be sown 15 cm (6 in) apart with a further 20 cm (8 in) between rows. Seedlings are ready for transplanting when they reach 15 to 20 cm (6–8 in) in height and have 5–7 leaves. Plants should be hardened prior to transplanting by gradually reducing the amount of water they receive. Plants should be spaced 50 cm (20 in) apart allowing 75 cm (30 in) between rows.",
      "care": "African eggplants will benefit from frequent irrigation during the dry season, particularly when fruiting, to ensure high yields. The crop should be weeded as required to prevent competition. Addition of fertilizer in the form of cattle or chicken or cattle manure or compost will improve yields.",
      "harvesting": "African eggplant is typically ready for harvest 100 to 120 days after planting. The fruit should be harvested before the skin changes color from white to pale yellow when the skin becomes tough. Fruits should be harvested regularly to encourage maximum fruit production. Young leaves may be harvested from 45-60 days of growth."
    },
    {
      "title": "Alfalfa",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/2226/file/default-0848af1431525dc766622dc146fd4a2f.jpg",
      "description":"Alfalfa, Medicago sativa, is an herbaceous perennial in the plant family Fabaceae (peas and beans) which is primarily grown as a forage crop which can be grazed by animals or harvested as hay to be used as an animal feed. Alfalfa has a deeply penetrating taproot and the stems of the plant branch from a woody base, growing upright and erect or along the ground. The leaves of the plant are made up of three individual leaflets (trifoliate) which are are narrow and oval or oblong in shape with a smooth upper surface and slightly hairy lower surface. Alfalfa plants produce flowers on racemes (flower stalks) and each raceme possesses 10–35 densely packed purple flowers. Alfalfa produces spirally coiled seed pods each containing 2–6 seeds. Pods may have a smooth or hairy outer surface. Alfalfa plants can reach a height of 120 cm (47 in) and live for between 3 and 8 years. Alfalfa is also commonly referred to as lucerne and is believed to have originated in Caucasus area, north-western Iran and north-eastern Turkey.",
      "scientific_name": "Medicago sativa",
      "common_name:": "lucerne, purple medic",
      "uses":"Alfalfa leaves are edible and can be eaten as a leafy vegetable. Alfalfa is used primarily as forage for animals and is cut and stored as hay or silage. As a legume, the plant fixes nitrogen so can be used to increase nitrogen in the soil and is a commonly used cover crop. Alfafa is a good source of vitamins, calcium, iron, phosphorus and potassium. Besides its use as feed, alfalfa has been traditionally used as a medicinal herb for humans. Its seeds and dried leaves can be consumed as supplements, or sprouted as edible alfalfa sprouts.",
      "basic_requirements": "Alfalfa is adapted to grow in a wide variety of environments but it requires careful management. Alfalfa grows best in deep, fertile, well-draining soils with a pH between 6.0 and 7.0. Alfalfa has a deep and vigorous root system and quickly depletes nutrients from the soil. If grown in a soil that is poor in nutrients, the crop may require the addition of copious amounts of fertilizer. The vigorous root system means that alfalfa can tolerate dry periods and still give a good yield.",
      "growing": "Soil should be well prepared prior to planting alfalfa seeds. A firm seedbed is recommended to improve the stand by improving seed contact with the soil. This helps seeds to retain moisture and prevents new roots from drying out. The soil can be firmed prior to planting by using a roller. The seedbed should also be free of weeds and kept moist. Alfalfa fields should be sown 5 cm (2 in) deep in rows spaced 45 to 60 cm (18 to 24 in) apart. Seeds should be watered immediately and the bed kept moist while the seedlings emerge.",
      "care": "The alfalfa stand should be kept free from weeds. The easiest way to achieve this when the crop is being grown on a commercial scale is with the use of a pre-plant herbicide. There are several of these product available for use on alfalfa. Fertilizer should be applied in accordance with soil test results. Lime, phosphorus and potash are the most important nutrients for a healthy alfalfa stand.",
      "harvesting": "Alfalfa is harvested at different times depending on it's intended use. Alfalfa which is cut between thee late bud and early bloom stage generally gives acceptable yields of high quality feed without reducing the quality of the stand. In contrast, repeated harvest of alfalfa which is till in the vegetative stage of growth leads to a reduced stand. In the first year, alfalfa can generally be harvested twice without any detrimental effect on winter survival; once in summer prior to the flowers emerging, and once later in the year with the date depending on location. Alfalfa is usually harvested by combine and baled as hay or cut for direct feeding to animals."
    },
    {
      "title": "Alomnd",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/3321/file/default-db2bc3a3033f5b335b26398676833498.jpg",
      "description":"The almond tree, Prunus dulcis, is a deciduous tree in the family Rosaceae that is grown for its edible seeds (nuts). The tree has brown or gray bark and either an erect or weeping growth habit, depending on the variety. The trunk can reach 30 cm (12 in) in diameter. Almond leaves are 7.5–13 cm (3–5 in) long with a serrated edge and grow alternately on the branches. The tree produces white to pale pink flowers and hairy green fruits that are oblong in shape. The fruit is a drupe, containing a single seed. The seed is protected by a hard brown shell. At maturity, the flesh of the fruit becomes leathery and splits to reveal the nut inside. Nuts generally measure 3.5 to 6 cm (1.4–2.4 in) in length. Almond trees can reach heights between 4 and 10 m (13 and 33 ft) and have a commercial lifespan of between 30 and 40 years. Almond may be referred to by variety and this includes bitter almond. Almond nuts are generally long and may also be referred to as sweet or bitter almonds, depending on the variety. They originate from wild species found in Central and Southwest Asia.",
      "scientific_name": "Prunus dulcis",
      "common_name:": "Almendras (Span1ish), amandes (French), mandorle (Italian), Mandeln (German), badaam (Indian), لوز (lawz in Arabic) 杏仁 (xìngrén in Mandarin Chinese) and アーモンド (āmondo in Japanese)",
      "uses":"The almond nut is eaten raw or processed into butter, flour, extract, oil, paste, syrup, and milk. Almond oil is used as a flavoring agent in baked goods, perfumery and medicines. Sweet almond oil is used for cosmetic creams and lotions. The hard shells of almonds can serve various functions, such as abrasives and sustainable materials.",
      "basic_requirements": "Almond grows best in Mediterranean climates with warm, dry summers and mild, wet winters. The optimal temperature for their growth is between 15 and 30°C (60–85°F) and the tree buds have a chilling requirement of between 300 and 600 hours below 7.2°C (45°F) to break dormancy. Almond trees will grow best when planted in deep, well-draining loam, although they can withstand drought and grow in poor soils. The trees benefit from being planted in areas sheltered from frost and wind, as trees bloom early and can therefore be susceptible to damage from late frosts. Trees will generally bear nuts after 3 to 4 years, with the nut crop developing after blossoming in the fall.",
      "growing": "",
      "care": "Almond trees will benefit from a layer of mulch around the base to prevent the growth of weeds and conserve soil moisture. Mulch should be spread around the tree in a 1 m (3 ft) radius. Leave a gap between the mulch and the trunk to prevent it from rotting. In addition, an application of fertilizer should be made once in the spring before any new growth and again in the fall.",
      "harvesting": "Almonds are typically harvested in the dry season, usually between August and October. The process begins with shaking the almond trees using mechanical tree shakers or hitting them with a pole, causing the mature almonds to fall to the ground. Once on the orchard floor, the fallen almonds are then collected and put in storage bins or trailers, which will later be transported for processing."
    },
    {
      "title":" Avocado",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/3350/file/default-7c920da83c99b4bda7904e32f2fde01d.jpg",
      "description": "Avocado, Persea americana, is an evergreen tree in the family Lauraceae which grown for its nutritious fruit, the avocado. The avocado tree is large and dome shaped with oval or elliptical leaves arranged in a spiral on the tips of branches. The leaves have a red pigmentation when they first emerge and turn green as they mature. Avocado trees produce clusters of small, green-yellow flowers at the end of twigs and a large, fleshy, pear-shaped fruit with a single large seed. The fruits can be purple to green in color with smooth or warty skin depending on variety. The flesh of the fruit is yellow-green in color and has the consistency of butter. Each fruit contains one large seed. Avocado trees grown from seed can take 4–6 years to produce fruit whereas grafted plants may produce fruit within 1–2 years. ",
      "scientific_name": "Persea americana",
      "common_name:": "Avocado (En)",
      "basic_requirements": "Avocados thrive in subtropical or tropical climates but can also be grown successfully in cooler areas of the world. The optimum temperature for growing avocado is between 25 and 33°C (77–91.4°F) with moderate humidity levels. Once established, trees can tolerate temperatures down to around -2°C (28°F) with minimal damage but young trees will not tolerate freezing temperatures. Avocado requires a well draining, aerated soil and they produce a shallow root system which require a warm soil for efficient water and nutrient uptake. Although trees will tolerate low rainfall, irrigation, particularly during flowering and fruit set, will ensure high fruit yields.",
      "care": "Newly planted young trees should be mulched after planting with several inches of straw or woodchips. Young trees will also benefit from staking which will help to prevent wind damage. Wood stakes should be driven into the ground outside the root ball allowing 2 stakes per tree. The tree should then be tied loosely to the stakes to provide support while it establishes.",
      "uses": "The avocado is usually consumed fresh as a fruit or as an ingredient in salads or savory dishes. It has a markedly higher fat content than other fruits and is a staple in diets that have limited access to foods with high contents of monounsaturated fats. It is the main ingredient in guacamole, a popular Mexican dip. In Asia, avocados are used in desserts and dessert drinks.",
      "harvesting":"Harvesting starts at 3-4 years from planting but a good yield is obtained from the 6th year onwards. It is not easy to tell when the fruits are ready for harvesting unless they are of the varieties that change colour at maturity. Harvest a sample and keep at room temperature. If they soften within 7-10 days without shrivelling then the fruit of that age are ready for harvesting."
    },
    {
      "title": "Banana",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/2747/file/default-e70d8c3d36a3064e7b93d57807bbd206.jpg",
      "description": "Banana, Musa spp., is a large, herbaceous plant native to Southeast Asia but now grown throughout the tropics. The banana plant is a large perennial herb with leaf sheaths that form trunk-like pseudostems. The plant is often mistaken for a tree but has no woody tissue. The leaves are large, 3–3.5 m (9.8–11.5 ft) long, and 0.6 m (2 ft) wide. The plant produces large, hanging clusters of fruit with a protective skin. The fruit is variable in size, color, and firmness, but is usually elongated and curved, with soft flesh rich in starch covered with a rind which may be green, yellow, red, purple, or brown when ripe. The fruit grows in clusters hanging from the top of the plant. Bananas are grown in tropical and subtropical regions of the world and are believed to have originated in Southeast Asia.",
      "scientific_name": "Musa paradisiaca",
      "common_name:": "Banana (En)",
      "basic_requirements": "Banana grows best in tropical and subtropical climates with temperatures between 20 and 30°C (68-86°F). The plant requires full sun and well-drained, sandy loam soils with a pH of 6.0-6.5. Banana is drought tolerant and can grow in soils with low fertility. The plant is sensitive to frost and cannot tolerate temperatures below -2°C (28°F).",
      "care": "Banana is propagated by seeds. The seeds should be planted in rows with a spacing of 30-40 cm (12-16 in) between plants and 75-90 cm (30-36 in) between rows. Banana requires regular watering during the growing season. The plant should be fertilized with nitrogen, phosphorus, and potassium to promote growth and yield. Banana is susceptible to pests and diseases such as aphids, spider mites, and bacterial wilt. The plant should be monitored regularly for signs of infestation and treated with appropriate pesticides.",
      "uses": "Bananas are a good source of vitamins and minerals, including vitamin C, vitamin B6, and potassium, and are often used as a healthy snack or ingredient in smoothies and other foods.The fruit is the most widely used part of the plant and can be eaten fresh or cooked or processed into starch, chips, puree, beer, vinegar or dehydrated to produce dried fruit. The fruit may also be processed into flour which is used in baking, soups or beverages. The flowers of the plant may be used as a vegetable.",
      "harvesting": "Banana harvesting is the process of collecting ripe or near-ripe bananas from the plant. The timing of the harvest is crucial, as it will determine the quality of the fruit and its intended use. To harvest bananas, one must first identify when the fruit is mature, which can be determined by observing signs such as yellowing of the fruit and leaves. Once the bananas are ready to be harvested, a sharp, clean knife should be used to cut the stem of the banana bunch from the plant. It's important to handle the bananas carefully to avoid bruising, and to gently place them in a container or on a flat surface for transport. "
    }, {
      "title": "Barley",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/2747/file/default-e70d8c3d36a3064e7b93d57807bbd206.jpg",
      "description": "Barley is classified under the genus Hordeum and the species vulgare It's an important cereal crop that belongs to the Poaceae family and is widely cultivated for its various uses in human consumption and industry.",
      "common_name:": "Barley (En)",
      "basic_requirements": "Barley grows best in cool, temperate climates with temperatures between 15 and 25°C (59-77°F). The plant requires full sun and well-drained, loamy soils with a pH of 6.0-7.5. Barley is drought tolerant and can grow in soils with low fertility. The plant is sensitive to frost and cannot tolerate temperatures below -2°C (28°F).",
      "care": "Barley is propagated by seeds. The seeds should be planted in rows with a spacing of 30-40 cm (12-16 in) between plants and 75-90 cm (30-36 in) between rows. Barley requires regular watering during the growing season. The plant should be fertilized with nitrogen, phosphorus, and potassium to promote growth and yield. Barley is susceptible to pests and diseases such as aphids, spider mites, and bacterial wilt. The plant should be monitored regularly for signs of infestation and treated with appropriate pesticides.",
      "uses": "Barley is cultivated as a food cereal in the tropics and subtropics in India, Nepal, Tibet, Afghanistan, Russia, Ethiopia, North Africa, and the Andean region of South America. The straw produced is used as animal feed, bedding, and to cover the roofs of houses.",
      "harvesting": "Barley is ready for harvesting 2-3 months after planting. The plant should be cut when it is fully mature and the leaves are green. The plant should be cut by hand or with a machine and the leaves should be dried in the sun for 2-3 days. The leaves can be stored in a cool, dry place for up to 1 year. Barley leaves can be used as forage for cattle and horses or as a cover"
    },{
      "title": "Black pepper",
      "description": "Black pepper, scientifically known as Piper Nigrum, is a climbing perennial plant in the family Piperaceae, It is mainly grown for its fruit, which is processed to create black, white, and green peppercorns, commonly used as a spice in cooking, The plants of black pepper may have either vining or bushy, woody stems.",
      "common_name:": "Black Pepper (En)",
      "basic_requirements": "Black pepper grows best in tropical and subtropical climates with temperatures between 20 and 30°C (68-86°F). The plant requires full sun and well-drained, sandy loam soils with a pH of 6.0-6.5. Black pepper is drought tolerant and can grow in soils with low fertility. The plant is sensitive to frost and cannot tolerate temperatures below -2°C (28°F).",
      "care": "Black pepper is propagated by seeds. The seeds should be planted in rows with a spacing of 30-40 cm (12-16 in) between plants and 75-90 cm (30-36 in) between rows. Black pepper requires regular watering during the growing season. The plant should be fertilized with nitrogen, phosphorus, and potassium to promote growth and yield. Black pepper is susceptible to pests and diseases such as aphids, spider mites, and bacterial wilt. The plant should be monitored regularly for signs of infestation and treated with appropriate pesticides.",
      "uses": "Black pepper plants are cultivated to produce black, white, and green pepper. The processing methods vary for each type:- Black pepper is the result of drying the fruit to produce the familiar black peppercorns. White pepper is produced by soaking the fruits in water for about a week to recover the seed from the decomposed fruit.  Green pepper is produced by drying unripe fruit in a way that retains its green color. Green peppercorns are often preserved by pickling.",
    "image": "https://plantvillage-production-new.s3.amazonaws.com/image/3247/file/default-33a8bb3c892d976a5354189b80f2d37d.jpg",
    "scientific_name": "Piper Nigrum",
    "harvesting": "Black pepper is ready for harvesting 2-3 months after planting. The plant should be cut when it is fully mature and the leaves are green. The plant should be cut by hand or with a machine and the leaves should be dried in the sun for 2-3 days. The leaves can be stored in a cool, dry place for up to 1 year. Black pepper leaves can be used as forage for cattle and horses or as a cover"
    }, {
      "title": "Blueberry",
      "description": "Blueberry, Vaccinium spp., is a deciduous shrub in the family Ericaceae grown for its edible fruits, The blueberry plant has a shallow root system and requires a well-drained, acidic soil, The plant produces white or pink flowers which develop into blueberries, The fruit is a small round berry that can be blue, purple, black, or red depending on the variety.",
      "common_name:": "Blueberry (En)",
      "basic_requirements": "Blueberries grow best in cool, temperate climates with temperatures between 15 and 25°C (59-77°F). The plant requires full sun and well-drained, sandy loam soils with a pH of 4.5-5.5. Blueberries are drought tolerant and can grow in soils with low fertility. The plant is sensitive to frost and cannot tolerate temperatures below -2°C (28°F).",
      "care": "Blueberries are propagated by seeds. The seeds should be planted in rows with a spacing of 30-40 cm (12-16 in) between plants and 75-90 cm (30-36 in) between rows. Blueberries require regular watering during the growing season. The plant should be fertilized with nitrogen, phosphorus, and potassium to promote growth and yield. Blueberries are susceptible to pests and diseases such as aphids, spider mites, and bacterial wilt. The plant should be monitored regularly for signs of infestation and treated with appropriate pesticides.",
      "uses": "Blueberries can be eaten fresh or can be dried or baked for further processing. Frozen or pureed berries are commonly used to make jams and preserves and baked goods. Lowbush blueberry is commonly used to make wine.",
      "scientific_name": "Vaccinium spp.",
      "harvesting": "Blueberries are ready for harvesting 2-3 months after planting. The plant should be cut when it is fully mature and the leaves are green. The plant should be cut by hand or with a machine and the leaves should be dried in the sun for 2-3 days. The leaves can be stored in a cool, dry place for up to 1 year. Blueberry leaves can be used as forage for cattle and horses or as a cover",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/2841/file/default-ff98c60b2bbbdd7e5e5a2e090921b089.jpg",
      "growing":""
    }, {
      "title": "Beet",
      "description": "Beets are herbaceous biennial root vegetables in the family Chenopodiaceae grown for their edible root and young leaves. The plant is usually erect with a long main root and a rosette of leaves growing on stems.  The leaves are oval in shape, arranged alternately on the stem and grow 20–40 cm (7.9–15.7 in) in length. The roots are usually red in color. It produces sessile green flowers that are surrounded by leaf-like bracts and grow on a 4ft tall spike-like structure.",
      "basic_requirements": "Beets are cool season vegetables with a long growing season. They grow best in cool climates but can tolerate some heat as well as some freezing. The optimum temperature for their growth is between 15.5 and 18.3°C (60–65°F). Beets grow best in a loose, well draining soil with a pH between 6.2 and 6.8 and should be planted in full sun for optimum development.",
      "care": "Weeding: Keep the area around your beet plants free of weeds, as they can compete for nutrients and water. Remove any weeds around plants by cultivating shallowly to avoid damaging the developing roots. Fertilizing: Test your soil to determine its nutrient content, and fertilize accordingly. Beets generally benefit from well-balanced, fertile soil. Beets also require an adequate supply of nutrients, particularly phosphorus. Apply a balanced, slow-release fertilizer or organic compost before planting.",
      "harvesting": "Young beet greens can be harvested for salads when they are 2.5–5.0 cm (1–2 in) high and older greens before they reach 15 cm (6 in) in length. Roots are also ready for harvest when the foliage starts to go limp. The roots are ready for harvest when they have reached 2.5 cm (1 in) in diameter and are most tender before they exceed 7.5–10 cm (3–4 in). Watering the soil the day before harvest or the day after rainfall makes pulling the beets easier. Pull beets out of the soil by firmly grasping the top and pulling the root out of the soil vertically. Alternatively, use a garden fork to dig the beets out of the soil. Cut the tops of the beets to 1.25–2.5 cm (0.5–1.0 in) above the root before storing the root. This helps keep the beets fresh.",
    "uses": "The roots are consumed after boiling and may be pickled in vinegar. The leaves of the spinach beet plant are consumed as a herb in Indonesia and Japan. Chemicals in the roots can be extracted and used as food coloring. Beets contain a significant amount of vitamins A and C, calcium, iron, phosphorus, potassium, protein and carbohydrates. Beets are also high in folate, dietary fiber and antioxidants. They are high in betaine which is prescribed to lower toxic levels of homocysteine (Hcy) (which contributes to the development of heart disease, stroke and peripheral vascular disease). The highest levels of vitamins and other nutrients are available when the vegetables are eaten raw. The beet greens are high in vitamin A.",
    "common_name:" : "Beet (En)",
    "scientific_name": "Beta vulgaris" ,
    "image": "https://plantvillage-production-new.s3.amazonaws.com/image/2610/file/default-a724245acd4ec1d03630937c108d4c22.jpg",
    "growing": ""
    }, {
      "title":" Carrot",
      "description": "Carrot, Daucus carota, is an edible, biennial herb in the family Apiaceae grown for its edible root. The carrot plant produces a rosette of 8–12 leaves above ground and a fleshy conical taproot below ground. The plant produces small (2 mm) flowers which are white, red or purple in color. The root can grow to between 5 and 50 cm (2.0–20 in) long and reach 5 cm (2.0 in) in diameter. The foliage of the plant can reach a height of 150 cm (59.1 in) when in flower. The carrot plant can be annual or biennial and may also be referred to as wild carrot. The plant is believed to have originated in Europe or the Western Mediterranean. ",
      "uses": "Carrot roots are eaten as a vegetable and can be consumed fresh or cooked. Carrot juice is consumed as a beverage. The leaves of the plant can be used as feed for animals.",
      "basic_requirements": " Carrots are cool-season crops which can be planted in early Spring and left in the ground all summer for harvest in the fall. Carrots grow best in a well-draining, loose, sandy soil which is free of large rocks and has a pH between 5.5 and 7.0. They require full sun for optimum development but will tolerate some very light shade. The optimum temperature for their growth is between 16 and 24°C (61–74°F). Carrot seedlings are very sensitive to extremes of temperature, very hot weather may kill the plant whereas temperatures below 10°C (50°F) tend to cause the development of longer, paler roots. The plants also require plenty moisture and organic matter. ",
      "care": "Carrots benefit from a plentiful moisture supply and should be provided with 2.5 cm (1 in) of water each week. Mulching around the plants helps to conserve moisture and reduce weeds. Any weeds growing around the plants should be carefully removed. The plants should be fertilized 5–6 weeks after the seeds are sown.",
      "harvesting": "Carrots are generally ready to harvest after around 2–3 months when the roots have reached 1.3 cm (0.5 in) in diameter. Allowing the carrots to stay in the ground for at least one frost makes them sweeter but care should be taken to harvest before the ground freezes or to cover the plants to prevent freezing. Carrots are harvested by gently digging around the plant to expose the top of the root and gently, but firmly pulling the root from the soil by grasping the top of the carrot just above the root. Carrot tops should be twisted off and the roots washed prior to refrigeration in airtight bags. Carrots may also be stored in moist sand to keep them fresh prior to use.",
      "common_name:" : "Carrot (En)",
      "scientific_name": "Daucus carota",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/36/file/default-871dcbb6c28610fea145661774a0968b.jpg",
      "growing": ""
    },
    {
      "title":"Chard",
      "description": "Chard, Beta vulgaris var cicla, is an herbaceous biennial plant in the family Chenopodiaceae grown for its edible leaves and leaf stalks. The chard plant has an erect growth habit with a basal rosette of leaves with long fleshy petioles which can be red or white in color. The leaves are large and wrinkled with a pronounced midrib and prominent veins. The chard plant can reach 30–40 cm (12–16 in) in height and is usually grown as an annual, harvested after one growing season. Chard may also be referred to as Swiss chard or silverbeet and likely originates from the Mediterranean.",
    "uses": "All parts of the chard plant are edible. The leaves and petioles (leaf stalks) are usually consumed after cooking with the former being eaten in a similar way to spinach and the latter similar to asparagus.",
    "basic_requirements": "Chard is best grown in moist, fertile, and organically rich soils. The soil should be light to sandy, and well drained with a pH between 6.0 and 7.0. The plants should be positioned in full sun or light shade. Chard grows best in cool climates and can tolerate moderate frosts although prolonged freezing will cause some varieties to bolt. The optimum temperature for growth is between 15.5 and 18.3°C (60–65°F).",
    "harvesting": "Leaves can be cut from the plant at any point after they develop but if plant is to reach maturity then it is best to remove the outer leaves that have fully developed first. ",
    "care": "Chard requires plenty of moisture to develop optimally. Even watering will promote the development of good quality roots. Soil moisture can be conserved by applying a layer of mulch around the plants. In addition to moisture, chard benefits from an adequate supply of nutrients. Apply a complete fertilizer at planting to ensure optimum development. Remove any weeds around plants by cultivating shallowly to avoid damaging the developing roots.",
    "common_name:" : "Chard (En)",
    "scientific_name": "Beta vulgaris var cicla",
    "image": "https://plantvillage-production-new.s3.amazonaws.com/image/3409/file/default-a330f38de85c4bc13ba66edb86fac04f.jpg",
    "growing": ""
    }, {
      "title": "Coffee",
      "description": "Coffee is grown in over 60 countries in the world, with the majority of the crop being produced in Brazil, Vietnam, Colombia, Indonesia, and Ethiopia. Other major African coffee-producing countries include Uganda, Ivory Coast, Tanzania, and Kenya, with the crop serving as a significant source of income for many farmers and an export commodity for many countries.he coffee plant has a woody perennial evergreen shrub or small tree that can grow up to 30 feet (9 meters) tall in the wild, although it is usually pruned to a height of 6–10 feet (1.8–3 meters) to make it easier to manage for cultivation. The plant has a straight trunk, elliptical leaves, and small, fragrant white flowers that bloom in clusters. After the flowers are pollinated, the fruit, known as a coffee cherry, develops.",
      "uses": "Coffee has a variety of uses beyond being a popular beverage. It is often used as an ingredient in cooking and baking, adding a rich and complex flavor to dishes. Coffee is also commonly used in the production of chocolate and is a key ingredient in espresso-based drinks like lattes and cappuccinos. In addition to its culinary uses, coffee has non-culinary uses as well. For example, coffee grounds can be used as a natural exfoliant in beauty products or as a deodorizer in the home. The caffeine in coffee is also used in some medications and cosmetics, as it has stimulating properties. Furthermore, coffee has been shown to have a variety of health benefits, including improving cognitive function and reducing the risk of certain diseases. Overall, coffee is a versatile and valuable commodity that has a range of uses beyond just being a beverage.",
      "harvesting": "Coffee is typically harvested by hand, which involves picking the ripe coffee cherries from the coffee plants. This can be accomplished through the use of either selective or strip-picking methods. Selective picking: involves going through the coffee fields and picking only the ripe coffee cherries. This is typically done in several phases, as the coffee cherries do not all ripen at the same time. The picker will gently pull the ripe cherry from the tree, taking care not to damage the surrounding branches or unripe cherries. Strip picking: Also known as milking, this is the complete removal of all the berries from the coffee tree at once. It can be done manually with hands or with machinery that shakes the tree and knocks off all of the cherries. However, strip picking is discouraged since it involves mixing mature and ripe cherries with immature and unripe ones, leading to ununiform drying and eventually reducing the taste and quality of the final product.",
      "basic_requirements": "Coffee plants grow best in tropical climates with temperatures between 15 and 30°C (59–86°F). The plants require well-drained, fertile soil with a pH between 6.0 and 6.5. Coffee plants are sensitive to frost and cannot tolerate temperatures below 0°C (32°F). The plants require regular rainfall or irrigation to thrive, with an annual rainfall of 1500–2000 mm (59–79 in) being ideal. Coffee plants also require shade, as they are sensitive to direct sunlight. The plants are typically grown under a canopy of taller trees, which provide protection from the sun and help maintain the humidity levels in the soil.",
      "care": "Growing coffee requires specific climatic, soil, and water conditions. It is a tropical crop that thrives in areas with warm temperatures, abundant rainfall, and well-drained soil. The ideal temperature range for coffee growth is between 60-70°F (15-24°C). Heat stress can be caused by temperatures above 86 °F (30 °C), while temperatures below 50 °F (10 °C) can damage the coffee cherries. In terms of rainfall, coffee plants require a lot of water but also need well-drained soil to prevent root rot. The ideal rainfall range for coffee growth is between 1200mm and 1800mm, well distributed over a period of nine months, with consistent rainfall throughout the growing season.",
      "common_name:" : "Coffee (En)",
      "scientific_name": "Coffea spp.",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/142442/file/default-39ef499f418e7327bb93c2399730a575.jpg"
    },{
      "title": "Cinnamon",
      "description": "Cinnamon is the collective name given to several plant species in the genus Cinnamomum (family Lauraceae), including Cinnamomum verum (syn. Cinnamomum verum; Ceylon cinnamon) and Cinnamomum burmanni (Indonesian cinnamon), grown for their inner bark which is used as a flavoring. Cinnamon trees are small evergreens with aromatic bark and leaves. The leaves of the tree are thick and oval or lanceolate in shape, growing on smooth gray branches. The tree produces small yellow or green flowers on panicles and a berry fruit. Cinnamon trees can reach heights of up to 20 m (66 ft) in the wild but are usually coppiced to smaller bushes under cultivation. Cinnamon trees have an economic lifespan of approximately 10 years. Cinnamon may be referred to as cassia and originates from Asia.",
      "uses": "Pieces of dried cinnamon bark (quills) or ground cinnamon are used a flavoring in baked goods, confection or savory dishes. Oil extracted from the bark and leaves is used as a flavoring or scent in perfumes.",
      "basic_requirements": " Cinnamon is a tropical plant and grows best in warm areas with high humidity where average temperatures reach approximately 27°C (80.6°F). Cinnamon can be grown in a wide range of soils but the highest quality bark is obtained when trees are grown in sandy soils rich in humus. Cinnamon grows best when planted in full sun but as a forest tree it will tolerate some shading. Trees require an average annual rainfall of between 1250 and 2500 mm.",
      "common_name:" : "Cinnamon (En)",
      "scientific_name": "Cinnamomum spp.",
      "care": "Cinnamon can be grown from seed or vegetatively propagated. Fruits often have to be bagged in order to save the seeds as they are often consumed by birds. Planting material should be selected from trees showing the desired bark characteristics which are healthy and vigorous regardless of the propagation method used. Cinnamon trees are usually cultivated commercially through cutting or by air layering due to the seeds exhibiting a wide genetic variability",
      "harvesting": "Cinnamon is harvested by cutting the stems of the tree and stripping the bark. The bark is then dried and processed into quills or ground into powder. The bark is harvested twice a year, once in the rainy season and once in the dry season. The bark is harvested by cutting the stems of the tree and stripping the bark. The bark is then dried and processed into quills or ground into powder. The bark is harvested twice a year, once in the rainy season and once in the dry season.",
      "image":"https://plantvillage-production-new.s3.amazonaws.com/image/3676/file/default-aeca2087f764c30a00454452215a0d5d.jpg"
    },
    {
      "title": "Dates",
      "description": "The date palm, Phoenix dactylifera, is an erect palm tree in the family Arecaceae grown for its edible fruit, the date. The trunk of the tree is covered in upward-pointing, overlapping, woody leaf bases and terminates in a crown of 20–30 leaves. The leaves are feather-like with spiny petioles and thick midrib. The leaf blades are pinnately divided and are blue-green in color. The uppermost leaves of the crown stand more erect while the lower ones droop and recurve toward the trunk. The tree produces small, fragrant cream-white flowers and the inflorescence may possess as many as 10,000 flowers. The fruits are produced in clusters and are oblong to ovoid berries with single stones and red-brown flesh. Date palms can grow to a height of 30 m (98 ft) and can live for up to 150 years, although they are usually replaced in commercial plantations when their productivity begins to decline. The date palm is believed to originate from Western Asia.",
      "uses":"Dates are consumed as a fresh or dry fruit. They are considered a staple in the deserts of North Africa and the Middle East. The fruit may also be used to make juice concentrates, fermented products (e.g. wines) or pastes for use in baking and confection.",
      "basic_requirements": "Date palms grow best in semi-arid climates close to water bodies such as rivers or oases, with an annual average temperature of 12–27°C (53.6–80.6°F) in regions where there is a long hot summer and mild winter. A mean temperature of 21–30°C (69.8–86°F) for at least one month is necessary for fruit production in addition to a period of no rainfall during flowering to prevent damage to the flowers. Date palms grow well in a wide range of soils provided they are well-draining, have a pH between 5.2 and 8 and are in close proximity to a body of water. Fruit production is highest when grown in sandy loams",
      "care": "Date development is aided by removing dead leaves and thorns from the trees, thinning of fruit and bunches and also the removal of bunches if the number per palm is too high. Allowing palms to over produce will reduce yield the following year. Each of these practices also aims to maximize fruit size and promote regular fruit production. When bunches begin to develop, they are pulled down and tied to lower leaves in order to protect them from damage from wind. Dates require dry and hot conditions to ripen in combination with the large amount of irrigation of the soil",
      "harvesting": "Harvesting of ripe dates requires reaching the top of the palm tree. This is achieved through the use of ladders which may be permanently fixed to the tree or through the use of machinery that can raise the worker on a platform. In the Northern Hemisphere, harvest begins at the end of the summer into early Fall and ends around November depending on the variety. Some varieties continue to be harvested after the onset of the rainy season but rain can damage the fruit and reduce its quality so the fruits are usually protected with the use of waxed paper or nylon sleeves.",
      "common_name:" : "Dates (En)",
      "scientific_name": "Phoenix dactylifera",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/3822/file/default-c48c47a08453ca1c281a9b9fdf2ccb27.jpg"
    }, {
      "title": "Ginger",
      "description": "Ginger, Zingiber officinale, is an erect, herbaceous perennial plant in the family Zingiberaceae grown for its edible rhizome (underground stem) which is widely used as a spice. The rhizome is brown, with a corky outer layer and pale-yellow scented center. The above ground shoot is erect and reed-like with linear leaves that are arranged alternately on the stem. The shoots originate from a multiple bases and wrap around one another. The leaves can reach 7 cm (2.75 in) in length and 1.9 cm (0.7 in) broad. Flowering heads are borne on shorter stems and the plant produces cone shaped, pale yellow flowers . The ginger plant can reach 0.6–1.2 m in height (2–4 ft) and is grown as an annual plant. Ginger may also be referred to as true ginger, stem ginger, garden ginger or root ginger and it is believed to have originated in the Southeast Asia.",
      "uses": "Ginger is popularly used as a spice in cooking and can be used either fresh, dried or powdered. The fresh rhizome can be used to extract ginger essential oil. Ginger may also be used to flavor beverages. Ginger continues to be a popular folk remedy in China and India.",
      "basic_requirements": "s As a tropical plant, ginger grows best in warm and sunny climates in a deep but well draining soil loam that is high in organic matter. The optimum soil pH for growth of ginger is between 6.0 and 6.5 and the plant requires a minimum temperature of 15.5°C (59.9°F). Ginger plants require an average annual rainfall of between 250 and 300 cm for optimal growth and development and require additional irrigation where rainfall is not adequate. Ginger plants will not tolerate waterlogged soils.",
      "care": "Ginger has a tendency to grow horizontally and the soil can be hilled around the growing stems to force a more vertical growth habit. Soil should be hilled 3 to 5 times during the growing season. Any exposed rhizomes should be covered with soil and weeds should be removed from the bed. Ginger will benefit from the addition of a complete fertilizer as well as phosphorous, calcium and organic matter prior to planting. During the growing season, additional fertilizer can be applied as a side dressing. The side dressing should be made 25 to 30 cm (10-12 in) from the row of plants due to ginger being easily damaged by fertilizer applications. ",
      "common_name:" : "Ginger (En)",
      "scientific_name": "Zingiber officinale",
      "harvesting": " Ginger is usually harvested after the leaves senesce, dry out and the stem falls over. Ginger roots are harvested by digging. Commercially produced ginger is harvested with the use of cutter bar which is pulled by a tractor. After harvest, the ginger should be cured for 3 to 5 days to prevent the development of mildew on the rhizomes.",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/3958/file/default-c48f081a1f105417d84a6798c4bced87.jpg"
    },
    {
      "title": "Garlic ",
      "description": "Garlic is one of the most used crops among the cultivated Allium species. It is a perennial flowering plant that grows from a bulb that contains outer layers of thin, whitish sheaths or skin that enclose various lobes known as cloves. One garlic bulb may contain 10 to 20 edible cloves that are asymmetrical in shape, except for the small ones, which are close to the center. Cloves, which are also covered by protective whitish skin, have a distinctive smell.",
      "uses": " Garlic is primarily used for flavoring food and can be dried, ground or powdered for this purpose",
      "care": "Garlic is a hardy plant that requires little care. It is best grown in well-drained soil with a pH of 6.0 to 7.0. Garlic should be planted in the fall, 4 to 6 weeks before the first frost. The cloves should be planted 2 to 3 inches deep and 4 to 6 inches apart. The plants should be watered regularly, but not overwatered. Garlic is a heavy feeder and should be fertilized with a balanced fertilizer in the spring. The plants should be weeded regularly to prevent competition for nutrients.",
      "harvesting": "Garlic is ready to harvest when the tops begin to turn yellow and fall over. The bulbs should be dug up carefully to avoid damaging them. The bulbs should be cured by hanging them in a warm, dry place for 2 to 3 weeks. The bulbs can be stored in a cool, dry place for up to 6 months.",
      "basic_requirements": "Garlic grows best in cool, temperate climates with temperatures between 15 and 25°C (59-77°F). The plant requires full sun and well-drained, sandy loam soils with a pH of 6.0-7.5. Garlic is drought tolerant and can grow in soils with low fertility. The plant is sensitive to frost and cannot tolerate temperatures below -2°C (28°F).",
      "common_name:" : "Garlic (En)",
      "scientific_name": "Allium sativum",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/3941/file/default-c9eef68fc11c591f729d30a6b61bf899.jpg"
    },{
      "title": "Guava",
      "description": "Guava, Psidium guajava, is an evergreen shrub or small tree in the family Myrtaceae grown for its edible fruits. Guava has a slender trunk with smooth green to red-brown bark. The trunk may be branched at the base and the branches droop low to the ground. The plant possesses oval or elliptical leaves which are smooth on the upper surface and hairy on the lower surface. Guava produces solitary white flowers and a berry fruit. The fruit is oval in shape and green to yellow in color. The flesh inside can be white, yellow, pink or red in color and contains numerous yellowish seeds. Guava can reach grow to 10 m (33 ft) in height and lives for approximately 40 years. Guava may also be referred to as common guava and its origin is unknown although it grows native in parts of tropical America. ",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/3976/file/default-a345e5ad1d3449a65bc3ea505649485e.jpg",
      "uses": " Guava fruits may be eaten fresh or processed to produce paste, jellies or preserves. Dehydrated fruit is used to make guava powder.",
      "basic_requirements": "Guava is mainly grown in the tropics and will tolerate temperatures between 15 and 45°C (59–113°F). Guava will grow optimally between 23 and 28°C (73–82°F) but established trees can tolerate short periods at -3 to -2°C (27-28°F) although temperatures below 15°C (60°F) can cause the tree to cease producing fruit. Guava is also amenable to a wide range of soils and will grow in both sandy or rocky soils in addition to loams, preferring a pH of 4.5–7 but tolerating alkaline soil to to pH 8.5. Guava is more resistant to drought than most tropical fruits and can withstand long periods of dry weather by ceasing vegetative growth until conditions improve",
      "care": "ewly planted guava trees should be watered every two days after planting for the first week and then once a week for the following few months to allow the root system to develop and become established. A 0.6 to 1.5 m (2.0-5.0 ft) area around the trunk should be maintained to be free from grass and weeds. Guava trees benefit from the application of a layer or organic mulch such as bark or wood chips around the base. This helps to suppress weeds and conserve moisture in the soil. Do not mound the mulch around the trunk, allow a gap of 20 to 30 cm (8-10 in) between the trunk and the mulch layer. Young trees benefit from fertilizer application with the type an amount varying with area and soil type. ",
      "harvesting": "Trees grown from seed may not come into production for anywhere between 3 to 8 years. Guava does not ripen off the tree and it can be difficult to distinguish when the fruits are ready for harvest. The best indication is a color change from dark to light green and the development of some yellowing on the fruits. Fruit should be harvested every 2-3 days to prevent fruit becoming overripe. ",
      "common_name:" : "Guava (En)",
      "scientific_name": "Psidium guajava"
    },
    {
      "title": "Kale",
      "description": "Kale, Brassica oleracea variant acephala, is a leafy herbaceous biennial or perennial plant in the family Brassicaeae grown as a leafy green vegetable. The kale plant is a non-heading, cabbage like plant with curly or straight, loose blue-green or purple leaves. Kale is usually grown as as an annual plant, harvested after one growing season and can reach a height of 1 m (3.3 ft). Kale may also be referred to as borecole or non-heading cabbage or broccoli and its exact origins are unknown, although it grows native in regions of the eastern Mediterranean and Asia.",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/2758/file/default-2c59a6a1bb9021f49d2ff94c41c96abf.jpg",
      "harvesting": "Kale leaves can be harvested when they are 20–25 cm (8–10 in) long. Harvest the outer leaves to avoid damaging the growing tip of the plant. Kale leaves are sweeter when they are harvested after frost",
      "care": "Kale is cool season crop that grows best in cool, moist conditions. The plant will grow best at temperatures between 4 and 21°C (40–50°F) allowing it to be grown in both Spring and Fall. Kale is a hardy plant, tolerating frost, and will grow optimally in a rich, moist, well draining soil with a pH of 6.5. Kale requires at least six hours of direct sunlight every day.",
      "basic_requirements": "Kale grows best in cool, moist climates with temperatures between 4 and 21°C (40–50°F). The plant requires full sun and well-drained, sandy loam soils with a pH of 6.0-7.5. Kale is drought tolerant and can grow in soils with low fertility. The plant is sensitive to frost and cannot tolerate temperatures below -2°C (28°F).",
      "common_name:" : "Kale (En)",
      "scientific_name": "Brassica oleracea variant acephala",
      "uses": "Kale can be good for adding fiber and antioxidants to the diet in many savory dishes, salads, and smoothies. Various health benefits include managing blood pressure and boosting digestive health. Kale is a leafy green cruciferous vegetable that is rich in nutrients. Kale is high in vitamins A, C, and K, as well as calcium, iron, and fiber. It is also a good source of antioxidants and other nutrients. Kale is considered a superfood due to its high nutritional value and health benefits."
    },
    {
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/4276/file/default-12712df4b81857bf0616ddb259713140.jpg",
      "title": "Lavender",
      "description": "Lavender is the name given to several species of herbaceous, perennial shrubs in the genus Lavandula which are grown as ornamental plants or for essential oil. Lavender plants are small, branching and spreading shrubs with grey-green leaves and long flowering shoots. The leaves can be simple or pinnate measuring 30–50 mm (1–2 in) in length. The plant produces flowers on shoots or spikes which can be 20–40 cm (8–16 in) long. The flowers are lilac or blue in color. Lavender can grow to 0.4 m (1.3 ft) in height and live for 20–30 years. Lavender may also be referred to as true lavender, medical lavender, smelling lavender, thin-leaved lavender or English lavender and is believed to originate from the Mediterranean, Middle East and India. ",
      "uses": "Lavender flowers can be used in cooking as a herb or used to produce lavender sugar. Fresh flowers can be used as a flavoring in desserts and sauces. Bees which collect lavender nectar produce a high quality honey. Lavender is also cultivated as an ornamental plant or for the extraction of essential oil. The flower spikes are popularly dried and used in flower arranging.",
      "basic_requirements": "Lavender grows very well in a wide range of climates, and optimally at temperatures between 7 and 21°C (44.6–69.8°F). Lavender plants require bright sunlight for adequate growth and should be positioned accordingly. The plants will grow best in light to sandy, well-draining soils with a pH of 5.8–8.3. The plants are drought tolerant once established but require regular watering while they establish",
      "care": "Once established, lavender requires little care. It benefits from prompt harvest if the flowers are to be used for further processing. Faded blooms should be removed to promote further blossoming. Light pruning encourages the plant to branch. Care should be taken not to over water the plants by allowing the plants to dry out between waterings.",
      "harvesting": " Flowerheads can be harvested from the plant at any time. Flowerheads to be used for the extraction of essential oil are best harvested when only 1/2 to 1/3 of the florets are open. Harvesting is usually done by hand but may be achieved mechanically in commercial production. after harvest, the flowers should be hung upside down in bunches to dry out. ",
      "common_name:" : "Lavender (En)",
      "scientific_name": "Lavandula spp."
    },
    {
      "title": "Lemon",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/2786/file/default-ff5c8a2cb32585533d3cb97787a8c75f.jpg",
      "uses": "Due to their bitter taste, lemon fruit is not usually consumed fresh. It is used widely to make juices such as lemonade, as garnishes in cooking and as a flavoring in cooking and baking.",
      "description": "Lemon, Citrus limon, is a small evergreen tree in the family Rutaceae grown for its edible fruit which, among other things, are used in a variety of foods and drinks. The tree has a spreading, upright growth habit, few large branches and stiff thorns. The tree possesses large, oblong or oval, light green leaves and produces purple-white flowers in clusters. The lemon fruit is an ellipsoid berry surrounded by a green rind, which ripens to yellow, protecting soft yellow segmented pulp. Lemon trees can reach 3–6 m (10–20 ft) in height and can live for many years, reaching full fruit bearing capacity in approximately 40 years. Lemon may also be referred to as bush lemon or Persian apple and likely originated from the eastern Himalaya of India.",
      "basic_requirements": "Lemon is a subtropical plant and the trees grow best in regions with a pronounced change in season. They will grow best at temperatures between 26–28°C (79–82°F) and are very sensitive to cold. Trees and fruit will be damaged or killed by freezing conditions without protection.The trees will tolerate drought conditions but perform poorly in water-logged soil. Trees will grow best when planted in a well-draining sandy loam with a pH between 6.0 and 7.5. Soil must be deep enough to permit adequate root development. Lemon trees will grow best when positioned in full sunlight",
      "care": "Newly planted trees require proper irrigation to ensure they become established. During the first year, water should be applied at the base of the trunk so that the root ball is kept moist to allow the roots to establish in the soil. Newly planted trees should be provided with water every 3–7 days. The soil should be moist, but not wet. Trees planted in sandy soils will require water more frequently. Young trees will also require a light application of fertilizer every month in the first year. Lemon trees will need protected from cold temperatures to prevent damage. Soil can be mounded up around the trunk during the winter and removed in the Spring. Young trees can also be protected from frosts by covering them with tarps or blankets as required. ",
      "common_name:" : "Lemon (En)",
      "scientific_name": "Citrus limon",
      "harvesting": "Lemons are harvested when they are fully ripe. The fruit should be cut from the tree rather than pulled to prevent damage to the tree. Lemons can be stored at room temperature for up to 2 weeks or in the refrigerator for up to 6 weeks. Lemons can also be frozen for later use."
    },
    {
      "title": "Lemon grass",
      "description": "Lemongrass, Cymbopogon citratus, is a perennial grass in the family Poaceae grown for its fragrant leaves and stalks which are used as a flavoring. The grass grows in dense clumps and has several stiff stems and slender blade-like leaves which droop towards the tips. The leaves are blue-green in color, turning red in the Fall and emit a strong lemon fragrance when damaged. Lemongrass produces large compound flowers on spikes when grown in the tropics, but rarely flowers when grown in more Northern latitudes. Lemon grass can reach a height of 1.8 m (6 ft) and will grow for several years, typically its economical lifespan is 4 years. Lemongrass may also be referred to as ginger grass or citronella grass and likely originates from Sri Lanka or Malaysia although a wild form of the plant is not known. ",
      "image":"https://plantvillage-production-new.s3.amazonaws.com/image/4305/file/default-af10d67ac086a8bb53d3710a2607ccab.jpg",
      "uses": "The stalks (leaf bases) of the plant are commonly used to flavor dishes in Southeast Asian cooking. The heart of young shoots may be cooked and consumed as a vegetable. The tougher leaves are used to flavor dishes but are typically removed before serving. Leaves may also be used to make lemon grass tea. The essential oil extracted from the leaves is commonly used in insect repellents, perfumes and soaps.",
      "basic_requirements": "Lemongrass is a tropical plant and as such will grow best in warm, sunny and humid conditions of the tropics and subtropics. The plants can be grown at temperatures ranging from 10 to 33°C (50-91.4°F) but will grow optimally at temperatures between 25 and 30°C (77–86°F). The grass will grow in a wide range of soils but grows best in well-draining, fertile loam with a pH between 5.0 and 8.4. The grass can also be successfully grown in containers. Plants can be successfully grown in full sun or partial shade.",
      "care": " Lemongrass requires regular rainfall and if being grown in drier climates the plants should be watered and misted regularly. Plants have a heavy requirement for nitrogen during the growing season and should be fertilized with a balanced soluble fertilizer once a month. Container grown plants should be fed more frequently. Lemongrass can grow very large and will quickly out compete weeds. However, younger plants should be kept free by carefully cultivating or hand pulling any weeds from around the plants.",
      "harvesting": " Lemongrass can be harvested at any time once the stalks have reached 1.3 cm (0.5 in) in diameter. Harvest stalks by cutting them at ground level with a sharp knife, or by bending the stalk and twisting.",
      "common_name:" : "Lemon grass (En)",
      "scientific_name": "Cymbopogon citratus"
    
    },
    {
      "title": "Mint",
      "description": "Mints belong to the genus Mentha and comprise approximately 20 species in the plant family Lamiaceae and are growm for their leaves which are widely used as a flavoring. Mint plants are mainly aromatic perennials and they possess erect, branching stems and oblong to ovate or lanceolate leaves arranged in opposing pairs on the stems. The leaves are often covered in tiny hairs and have a serrated margin. Mint plants produce a terminal flower spike and the flowers can be white or purple in color depending on variety. Mint plants are fast growing and can become very invasive. They can reach heights of 60–90 cm and will cpntinue to grow for many years once established. Mint may also be referred to by species and these include, but are not limited to peppermint, spearmint, water mint and Japanese mint.",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/385/file/default-794971098fabf67847a412a6ca3f447d.jpg",
      "uses": "Mint leaves are used fresh or dried to make teas, jams and desserts. Essentila oil can be extracted from the leaves and is used as a flavoring.",
      "basic_requirements": "Mint is a rapidly growing plant which is very easy to grow. It is best grown in partial shade to full sun and is generally very hardy, tolerating temperatures down to -29°C (-20°F). Care should be taken with variegated varieties which may scorch in full sun. Mint is very fast growing which can lead to it invading gardens quickly unless controlled. The best soils for planting mint are rich and moist with a slightly acidic pH between 6.0 and 7.0",
      "care": "Mint is very vigorous and should be pruned regularly to keep the plants in check. Remove any unwanted runners and pinch the tips of the plants back regularly. Mint may be fertilized in the Spring with a slow release fertilizer to supply it with nutrients throughout the growing season. Pinch of any flowers that form to conserve the flavor of the leaves. Essential oil content is reduced during bloom. In areas with mild winters, mint can be moved to a sheltered area of the garden to overwinter, otherwise the plant can be cut to the ground in the Fall. Container grown mint plants can be brought indoors",
      "harvesting":" Mint leaves can be harvested as soon as the plants have reached 8 to 10 cm (3-4 in) in height. Cut leaves and stems with a sharp knife or scissors. If harvesting whole stems, cut the stem at about 2.5 cm (1 in) from the soil line.",
      "common_name:" : "Mint (En)",
      "scientific_name": "Mentha spp."
      
    },{
      "title": "Mustard",
      "description": "Mustards, (Brassica spp.) are herbaceous annual plants in the family Brassicaceae grown for their seeds which are used as a spice. Mustard plants are thin herbaceous herbs with yellow flowers. The leaves of the plant are toothed, lobed, and occasionally have the larger terminal lobes. Plants can reach 16 cm (6.3 in) in length. The yellow flowers grow in spike like clusters of 2–12 flowers and individual flowers are 8 mm (0.3 in) in diameter. The seeds are red to brown in color and produced from each flower. Mustard can grow 1.2-2 m (4–6.6 ft) in height and as an annual plant, survives only one growing season. Mustard may also be referred to as mustard, brown mustard, red mustard, yellow mustard or wedlock and is believed to have originated in the temperate regions of Europe.",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/4437/file/default-d1ee0ab995606a35d10ad3deed9f25da.jpg",
      "uses": "he leaves and shoots of the mustard plant are consumed as a vegetable in some countries. Mustard seed is incorporated into seasonings and dressings. Mustard may be grown as a cover crop in rotation with other vegetables",
      "basic_requirements": " Mustard grows very well in cool climates with short growing seasons, at temperatures as low as 4.4°C (40°F). Seedlings can tolerate some light frost but severe frost will kill the plants. The mustard plant can be grown in sandy, loamy or clay soils with a pH between 4.9 and 8.2 and prefers moist soil. The plant will tolerate partial shade. ",
      "care": "Weeds can cause huge losses in mustard cultivation as they quickly out compete seedlings and are difficult to eradicate once established. The best method of preventing weed growth in a mustard field is to plant seeds at the appropriate depth. Shallow planted seeds germinate rapidly, allowing the development of a uniform plant stand. Established plants are less susceptible to competition from weeds. soil should be tested to determine nutrient requirements prior to planting. Mustard will benefit from the addition of supplemental nitrogen and this is generally applied at a rate of 100–120 lb per acre. ",
      "harvesting": "Mustard is generally ready to harvest 80 to 85 days after planting. The crop should be harvested promptly to reduce losses to shattering. In commercially grown fields the recommended method of harvest is swathing. The plants should be cut just below the height of the lowest seed pods. In the home garden, mustard can be harvested by hand by cutting the plants. The seeds can then be recovered from the pods and dried for storage.",
      "common_name:" : "Mustard (En)",
      "scientific_name": "Brassica spp."
    
    },
    {
      "title": "Molokhia (Mallow)",
      "description":"Molokhia, Corchorus olitorius, is an herbaceous annual plant in the family Malvaceae grown for its edible leaves which are consumed as a vegetable. The molokhia plant is tall and is either unbranched or possesses few lateral branches. The stems and leaves of the plant can be dark red or dark green or an intermediate color. The leaves are oval and tapering with serrated edges. The plant produces yellow flowers and pods that contain the seeds. Molokhia can grow to a height of 2–4 m (6.5–13 ft) and is an annual, harvested after one growing season. Molokhia may also be referred to as jute, nalta jute, red jute or mallow and likely originates from Africa. ",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/4408/file/default-b9f0c3cb2016a49918c44a5850f2571f.jpg",
      "uses": "The leaves of the plant are usually consumed after cooking as a vegetable. The stems and leaves exude a sticky gum-like substance (mucilage) when cooked, giving it a texture similar to okra. It is commonly incorporated into stews.",
      "basic_requirements": "Molokhia typically requires warm, humid conditions to thrive and will grow best in deep, loose soils. It will grow well in sandy or clay loam with a pH between 5 and 8.6. It requires an average monthly rainfall of 75-100 mm. It is reported tolerate average annual temperatures of between 6.8 and 27.5°C (44.2-81.5°F). ",
      "care": "Molokhia is a fast growing plant and will require regular watering to maintain growth. The plant will benefit from the addition of a balanced fertilizer at planting and again at 4–6 weeks after planting. The plant should be kept free from weeds which can quickly out compete the plant. The plant should be pruned to remove any dead or damaged leaves and to promote growth. The plant should be staked to prevent it from falling over. ",
      "harvesting": "Molokhia leaves can be harvested when they are 10–15 cm (4–6 in) in length. The leaves should be harvested by cutting them from the plant with a sharp knife or scissors. The leaves can be harvested as needed throughout the growing season. ",
      "common_name:" : "Molokhia (En)",
      "scientific_name": "Corchorus olitorius"

    },
    {
      "title": "Mushrooms",
      "description": "Mushrooms are the fleshy fruiting bodies of fungi and include edible species in the genus Agaricus (button mushrooms, portabellas and criminis), Pleurotus (oyster mushrooms), and Volvariella, (straw mushrooms). Mushrooms are highly variable in appearance depending on their stage of development and variety. Agaricus mushrooms have a cap and stem, the cap is a pale grey or brown in color and is rounder while immature, but flattens out as it reaches maturity and can reach a diameter of 5–10 cm (2–4 in). Pleurotus mushrooms may not have a stem and instead may be laterally attached to a growing substrate such as the bark of a a tree. Pleurotus mushrooms are smooth and elongated and can reach 4–15 cm (1.5–6.0 in) in diameter. Volvariella mushrooms are small, with pink gills and a characteristic sac-like covering (volva) at the base of the stem. The cap can reach 5–15 cm (2–6 in) in diameter.",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/4431/file/default-ee6842965a53856791457b2a46d30de1.jpg",
      "uses": " Mushrooms are widely used after cooking and are incorporated into many dishes worldwide.",
      "basic_requirements": "Mushrooms grow from a filamentous mass (mycelia or 'spawn') that grows on dead or decaying plant material. Agaricus mushrooms can be cultivated in a dark, moist, cool space such as a basement. Agaricus mushrooms require a rich organic material in which to grow such as horse manure. Oyster mushrooms are cultivated on hardwood logs by introducing spawn into pre-drilled holes in the wood or or by sawing a section through the log and covering the exposed wood in spawn before nailing the log back together. The logs are then stored in watertight bags containing sand and soaked with water. Oyster mushrooms can also be grown in straw or sawdust by inoculating the sterile substrate with spawn and sealing in plastic bags. Straw mushrooms can be grown on wheat straw, rice straw or sawdust inoculated with spawn and stored at temperatures between 28 and 36°C and relative humidity of 75–85%. ",
      "harvesting": "Harvest the mushrooms at soil level by carefully twisting them or by cutting them at soil level with sharp knife. Pulling can damage other surrounding mushrooms. Harvest flushes of mushrooms daily. The beds will continue to produce for up to 6 months.",
      "common_name:" : "Mushrooms (En)",
      "scientific_name": "Agaricus spp., Pleurotus spp., Volvariella spp.",
      "care": "When growing mushrooms, it's important to maintain proper environmental conditions such as darkness, moisture, and temperature. Regularly check the growing substrate for signs of contamination and remove any contaminated material promptly. Keep the growing area clean and free from pests. When storing mushrooms, keep them in a paper bag or a porous container in the refrigerator. Avoid storing them in plastic bags as this can cause them to become slimy. Use mushrooms within a few days of purchase for the best flavor and texture, and avoid washing them until you're ready to use them."
    },
    {
      "title": "Oil palm",
      "description": " Oil palm, includes the palm species native to Africa, Elaeis guineensis, and the species native to South and Central America, Elaeis oleifera. Both species are perennial tropical trees in the family Arecaceae which are grown for their oil which is used in cooking and in industry. Oil palm trees are unbranched with a long stout single stem, or trunk, terminating in a crown of 7–100 leaves. The leaves are pinnate and can reach 3–5 m (9.8–16.4 ft) in length. The tree produces large, spherical red fruits in bunches. Up to 200 fruits can be produced per bunch and and the oil is extracted from the pulp and kernel. Oil palm can reach heights of 20–30 m (65.6–98.4 ft) and has an economic lifespan of 25–30 years, at which point they become too tall to be managed efficiently and are cut down. Left alone, oil palm has been known to live for periods up to 200 years. Oil palm may also be referred to as African oil palm and originated from West Africa.",
      "uses": " Palm oil is widely used as a cooking oil, as an ingredient in many processed foods and as a substitute for butter. Palm oil can be used to produce biodiesel. Palm oil is also used as a binding agent in cosmetics.",
      "basic_requirements": "Oil palm is typically grown in tropical lowland regions over large areas. The tree requires deep soil and stable high temperatures (30–32°C/86–89.6°F for at least 80 days) for optimum productivity. Temperatures below 20°C (68°F) will severely reduce the growth of both species, while the African oil palm will also suffer a reduction in growth at temperatures above 40°C (104°F). Palms will grow in a variety of deep tropical soils and will tolerate a pH between 4.0 and 8.0. Oil palms have a requirement for continuous moisture throughout the year. The trees can tolerate 2–3 months of dry conditions but it can affect yields. ",
      "care": "Oil palms are frequently planted along with a leguminous cover crop which helps provide nitrogen to the palms while also suppressing weeds. When bunches are harvested, it is usual for fronds to be pruned. The number of fronds per palm is maintained at between 35 and 40. Oil palm plantations are rarely, if ever, irrigated. Due to the moisture requirements of the palms, supplemental irrigation is recommended during dry spells. ",
      "harvesting": " Harvesting of oil palms generally begins 2.5 years after the trees are planted in the field. Harvesting takes place throughout the year, usually at 2–3 week intervals, as the bunches ripen. Bunches are harvested by cutting from the tree using a sharp knife or sickle. ",
      "common_name:" : "Oil palm (En)",
      "scientific_name": "Elaeis guineensis, Elaeis oleifera",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/309/file/default-60b193a27f5ec81a9b6ff659e91f6142.jpg"
    },
    {
      "title": "Orange",
      "description": "Orange, Citrus sinensis, is an evergreen tree in the family Rutaceae grown for its edible fruit. The orange tree is branched with a rounded crown and possesses elliptical or oval leaves which are alternately arranged on the branches. The leaves have narrowly winged petioles, a feature that distinguishes it from bitter orange, which has broadly winged petioles. The tree produces white flowers singly or clustered on a raceme. The fruit is a spherical berry with a green-yellow to orange skin covered in indented glands and a segmented pulpy flesh and several seeds. Orange trees can grow to a height of 6–15 m (16–49 ft) and can live for periods in excess of 100 years. Most plantations have an economic lifespan of around 30 years. Orange may also be referred to as sweet orange or navel orange and is believed to have originated from a wild ancestor in the border between Vietnam and China",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/2721/file/default-eb9fcbac38fe8c569ff3ab9e9a1a698f.jpg",
      "uses": " Oranges can be consumed as a fresh fruit and are commonly pressed or squeezed to produce orange juice.",
      "basic_requirements": "Orange is a subtropical plant and the trees grow best in regions with a pronounced change in season. They will grow best at temperatures between 12.8 and 37.8°C (55–100°F) during the growing season and 1.7 to 10°C (35–50°F) during dormancy. Mature orange trees can survive short periods of freezing, whereas young trees will be killed. Trees should be protected from frosts and freezing conditions to prevent damage. The trees will also tolerate drought conditions but perform poorly in water-logged soil. Trees will grow best when planted in a well-draining sandy loam with a pH between 6.0 and 7.5. Soil must be deep enough to permit adequate root development. Orange trees require full sun and should be protected from wind which can cause damage to the trees.",
      "care": "Newly planted trees require proper irrigation to ensure they become established. During the first year, water should be applied at the base of the trunk so that the root ball is kept moist to allow the roots to establish in the soil. Newly planted trees should be provided with water every 3–7 days. The soil should be moist, but not wet. Trees planted in sandy soils will require water more frequently. Young trees will also require a light application of fertilizer every month in the first year.", 
      "harvesting": "Orange trees can be purchased as seedlings which have already been grafted and only require planting in the garden or orchard. The best time to plant citrus trees is in Spring after all danger of frost has passed in your area. Standard sized trees should be spaced 3.7–7.6 m (12–25 ft) apart in an area that receives full sunlight, but is protected from strong winds which can damage the trees. Planting against a south facing wall will help protect the tree in cooler climates",
      "common_name:" : "Orange (En)",
      "scientific_name": "Citrus sinensis"
      
    }, 
    {
      "title": "Pineapple",
      "description": "Pineapple, Ananas comosus, is an herbaceous biennial or perennial plant in the family Bromeliaceae grown for its edible fruit. The pineapple plant has a short stout stem and a rosette of sword-shaped leaves with needle-like tips. The leaves are waxy, have upturned spines on the margins and may be soild green or striped with red, white or cream. When the plant flowers, the stem begins to elongate and produces a flower head of small purple or red flowers, each with a pointed bract. The stem continues to elongate and sets down a tuft of of short leaves called a 'crown'. Individual fruits develop from the flowers and fuse to form one large cylindrical fruit topped by the crown. This fruit, known as a pineapple, has a tough rind made up of hexagonal units and a fibrous, juicy flesh which may be yellow to white in color. Pineapple may reach 1.5–1.8 m (5–6 ft) in height and some varieties can grow for in excess of 20 years. Pineapple originates from the tropical regions of the Americas.",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/4636/file/default-815aef0218f84ac9554693ceff543ac3.jpg",
      "uses": "Pineapple fruit is commonly eaten fresh or it may be cooked in a variety of dishes. Pineapple may also be canned or used to produce juice.",
      "basic_requirements": "Pineapple is a tropical plant and grows best in temperatures between 23–32°C (73.4–89.6°F). The plant can tolerate colder temperatures for short periods but will be killed by frosts. Pineapple will grow optimally in well-draining sandy loam which is rich in organic matter. The optimum pH for pineapple growth is between 4.5–6.5. Established pineapple plants are tolerant of drought but will not tolerate waterlogged soil which quickly leads to root rot",
      "care": "Pineapples require supplemental irrigation during dry spells for optimum production. Mulching around the plants will help to conserve soil moisture. Ratooning may also be utilized as a means of encouraging growth. After the first crop of fruit, ratooning the plants will result in new fruit within 18 months. This process may be repeated a second or third time but then the crop will be rotated to prevent build up of disease. Removing suckers and slips from developing plants helps the plant to focus energy on growing the fruit and leads to larger fruit that develops quicker. Pineapples benefit from the application of additional nitrogen and potassium. Application rates depend largely on the type of soil the plants are growing in. Generally, little fertilizer is required during the first few months following planting but requirements increase rapidly in the period leading up to flower development. Fertilizers are usually applied as foliar sprays. ",
      "harvesting": "Pineapples are ready to harvest when at least one third of the fruit rind has turned from green to yellow. Fruits are harvested by hand by cutting the crown and peduncle from the plant. The fruit will continue to ripen off of the plant. ",
      "common_name:" : "Pineapple (En)",
      "scientific_name": "Ananas comosus"
    },
    {
      "title": "Pistachio",
      "description": "Pistachio, Pistacia vera, is a deciduous tree in the family Anacardiaceae grown for its edible seeds (nuts). Pistachio is a small to medium sized tree with a branching main stem (trunk) and a spreading growth habit. The leaves of the pistachio are pinnate and composed of five individual oval leaflets. Male and female inflorescences are produced on different trees (dioeceous).The flowers are small, brownish-green in color and lack petals. They are produced on panicles, each possessing several hundred flowers. The fruit of the tree is a drupe with an oblong kernel covered with a thin, bony shell. The shell splits along its long axes when mature. Pistachio trees can reach up to 20 ft (65.6 ft) in the wild but are generally smaller under cultivation. They reach maximum productivity in terms of fruit production after approximately 20 years and can live for several hundred years. Pistachio may also be referred to as green almond and originated from western Asia.",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/4687/file/default-a2df67f6d609ae6bf4bcb2a31e62579a.jpg",
      "uses": " Pistachio nuts are eaten as a snack food, usually after salting and roasting.",
      "basic_requirements": "Pistachio trees grow best in areas with a long hot summer and cold winter as the tree has a chilling requirement. The tree is tolerant of frost and can withstand winter temperatures as low as -20°C (-4°F). Trees are also drought resistant and can be grown on a wide range of soils, including rocky or stony soils, without irrigation but trees will grow optimally in well draining, deep sandy loams. Pistachio trees are wind pollinated and require the planting of both male and female trees for successful pollination and fruit set. ",
      "care":"Pistachios have a similar nitrogen requirement to other nut trees. Fertilizer should not be applied in the first year following planting but in the subsequent year, each tree should be supplied with 1 lb of ammonium sulfate split between two applications over the course of the growing season. In the years following, trees should be fertilized with actual nitrogen with application rates varying from 100 to 150 lb per acre. The nitrogen should be split evenly into two applications over the growing season. no nitrogen should be applied after June to prevent vigorous growth that may delay the tree entering dormancy, potentially leading to damage from early frosts.",
      "harvesting": "Newly budded pistachio trees will not begin to produce fruit for five years and will not reach maximum production until the twelfth year. Nuts are ready to harvest when the hull separates easily from the shell. This period extends for 7 to 10 days. If nuts are harvested before or after this critical period kernels may be underdeveloped and shells may become stained. ",
      "common_name:" : "Pistachio (En)",
      "scientific_name": "Pistacia vera"
    }, {
      "title": "Pear",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/4564/file/default-d4328ca8c4703ee086524c3681ae5bcc.jpg",
      "description": "The European pear, Pyrus communis, is a perennial deciduous tree in the family Rosaceae, grown for its fruit. The tree is a short deciduous tree with a tall and narrow crown and alternately arranged, simple leaves. The leaves are elliptical with finely serrated margins and defined tips and can reach 2–12 cm (0.7–4.7 in) in length. The tree produces white flowers which are 2.5 cm (1 in) in diameter and a fleshy green pyriform fruit. Pear trees can reach 9 m (30ft) and will produce fruit for about 20 years . The European pear may be referred to by name of its cultivars which include the Bartlett, d'Anjou, Kaiser Alexander and Comice pears. The European pear occurs only as cultivated trees and does not grow wild in nature. It is descendant of wild European and Asian pear trees.",
      "uses": "The pear fruit is eaten fresh or can be cooked in a range of sweet dishes. The fruit may also be pressed for juice. The leaves of the tree can be used to produce dyes and the wood can be used in carpentry and is very durable.",
      "basic_requirements": "Pears grow very well in areas that have a late frost and a cool, dry summer and will grow at temperatures between -26 and 45°C (-14.8–133°F). Pear trees have a chilling requirement of between 1000 and 1500 hours between 0 and 7°C (32–44.6°F) to break dormancy depending on the particular variety being grown. Generally, trees must cross pollinate with a different variety in order to successfully set fruit. Pear trees require a deep, well draining soil with a pH of 6–7 and will grow in sandy, medium or heavy soil. Pear trees are the most tolerant of all fruit trees of wet soils but roots should not be waterlogged for more than a few days at a time. ",
      "care": "The amount of fertilizer that should be supplied to pear trees depends on the soil type and composition and should be checked with the aid of a soil test. Less nitrogen is supplied to pear trees than to apple as it promotes vigorous growth, increasing susceptibility to fire blight. in the first year of growth, phosphorous and potassium may be required but in subsequent years, only nitrogen is generally added to the soil. The area around the base of the pear tree should be kept free from weeds which compete for water and nutrients. In commercial plantations, appropriate herbicides may be used for weed control. In the home garden, weeds can be removed by hand. Pear trees may require fruit to be thinned to prevent over production which can lead to reduced yields in subsequent years or cause damage to the tree through excess weight",
      "harvesting": "Pear fruits are usually harvested when mature, but are are ripened off of the tree. Pear allowed to ripen on the tree tend to ripen from the core outwards, resulting in fruit with mushy centers. It can be difficult to determine the correct time to harvest pears and so a variety of factors should be taken into consideration prior to picking. One of the most common indicators of maturity is the firmness of the fruit. Commercial plantations use devices called penetrometers to determine fruit firmness. Pears should be harvested when the reading is between 16 and 19 pounds. ",
      "common_name:" : "Pear (En)",
      "scientific_name": "Pyrus communis"

    },
    {
      "title": "Raspberry",
      "description": "Raspberry is the name given to two plant species in the genus Rubus, Rubus idaeus (red raspberry) and Rubus occidentalis (black raspberry) grown for their edible fruit. Raspberry plants have perennial root systems and biennial stems which are known as canes. The canes are woody, erect and shrub-like and generally undergo a period of growth one year and fruit production the next although primocane varieties exist that produce fruit in the first year. The canes may possess spines. Raspberry plants produce white or pink flowers with five petals which are surrounded by green sepals. After the plant has been pollinated, an aggregate berry is produced which consists of numerous druplets which are held together into the familiar raspberry fruit by tiny hairs. Raspberry canes can grow from 0.5 to in excess of 2 m (1.6–6.6 ft) in height and red raspberry will produce a commercial yield of fruit for 16–20 years, while black raspberry has a shorter lifespan and will produce for 4–8 years. Red raspberry may also be referred to as European raspberry, red garden raspberry or hindberry, while black raspberry may be referred to as blackcap raspberry and may have originated in the Ide mountains of Turkey.",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/119/file/default-b3593443ea9c9566134aabad794cff8f.jpg",
      "uses": " Raspberries are primarily consumed as a fresh fruit or may be processed into jams, jellies, juices and pulp.",
      "basic_requirements": "Raspberry plants grow best in regions with cool summers and relatively mild winters. The plants are sensitive to high temperatures and grow best when daytime temperatures are around 25°C (77°F). Raspberries are best suited to well-draining sandy loams, rich in organic matter and have a pH between 5.5 and 6.5. Drainage it critical in raspberry propagation as the plants are susceptible to root rot. Plants require full sunlight and should not be planted in low lying areas where water may build up. Raspberries also require a post support system or trellis to support the weight of the fruit on the canes. Raspberry canes are biennial and produce fruit in the second year of growth. Canes in their first year of growth are called primocanes and those in the second year of growth are called fruiting canes or floricanes. The young canes are green in color, whereas the older floricanes are tougher and have a woody covering making them easy to tell apart. ",
      "care": "Raspberry plants require regular irrigation to maintain growth and fruit production. The plants should be watered at the base to prevent the leaves from becoming wet which can lead to disease. The plants should be mulched to conserve soil moisture and suppress weeds. Raspberry plants require regular fertilization to maintain growth and fruit production. The plants should be fertilized in the Spring with a balanced fertilizer and again in the Fall with a fertilizer high in potassium. The plants should be pruned to remove any dead or damaged canes and to promote growth. The plants should be pruned in the Spring before new growth begins. Raspberry plants are susceptible to a number of pests and diseases and should be monitored regularly for signs of infestation. ",
      "harvesting": "Raspberries are ready to harvest when they are fully colored and easily separate from the receptacle. The fruit should be harvested by hand by gently pulling the fruit from the plant. The fruit should be harvested regularly to prevent over ripening and to encourage further fruit production. ",
      "common_name:" : "Raspberry (En)",
      "scientific_name": "Rubus idaeus, Rubus occidentalis"
    },
    {
      "title": "Strawberry",
      "description": "Strawberry is the name given to several plant species in the genus Fragaria, including Fragaria vesca (wild strawberry), Fragaria grandiflora, Fragaria magna, Fragaria chiloensis and Fragaria ananassa (or Fragaria x ananassa) which are grown for their edible fruit. Strawberry is an herbaceous perennial in the family Rosaceae. The plant has a short stem and trifoliate leaves which form a crown. close to the ground. The leaves display a variety of characteristic depending on the species, some are evergreen whereas some have leaves that will die and fall off in winter. The plant produces flower stalks from the crown and the the flowers are white in color. The fruit of the plant is red and fleshy with small seeds on the outside. Strawberry can grow 20–25 cm (8–10 in) in height and has an economic life of 2–4 years before the plants are replaced. Strawberry may also be referred to as garden strawberry and the plant is grown in most northern temperate regions of the world. The first domestic hybrids were created in Europe.",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/132/file/default-fb5ebfb1f3674b9b7c6865854776f15c.jpg",
      "uses": " Strawberries are consumed as a fresh fruit or can be used to produce jams, jellies or preserves. ",
      "basic_requirements": "Strawberries grow very well in cool temperate climates, at temperatures below 30°C (86°F)and require at least 8 hours of sunlight per day. They can be grown successfully in a wide variety of soils from sandy soils to silty clay but will grow best in a deep, well draining loam rich in organic matter. The optimum pH for their growth is between 5.5 and 6.5. If drainage is poor then it is recommended to plant strawberry on beds raised by a minimum of 15–20 cm (6–8 in).",
      "care": " In the first growing season after planting, the plants should not be allowed to produce fruit in order for the plants to concentrate their energy of vegetative growth. Pinch off any flowers as they are produced. Fruit can be harvested in the year after planting. When the desired density of plants is reached cut off any runners or cultivate with a hoe. Weeds should also be removed from the strawberry bed regularly. Strawberry plants also require adequate moisture and should receive 2.5–3.8 cm (1–1.5 in) of water per week either from rainfall or irrigation if needed. Strawberries will benefit from the addition of mulch which helps to conserve soil moisture and protects the plants from late frosts in Spring. If frost is forecast after planting the plants should be protected with row covers or other suitable material. Plants can also be protected with sprinkler irrigation. Row covers can also be used to protect the fruit from birds when fruiting.",
      "harvesting": "Fruit should be harvested regularly (every other day) when it is being produced by picking the berry along with the cap and 0.5 in of stem. remove the berries by pinching the stem. Harvest only fully ripe strawberries as they will not ripen further after harvest.",
      "common_name:" : "Strawberry (En)",
      "scientific_name": "Fragaria spp."

    },
    {
      "title": "Sweet potato",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/134/file/default-c810f09877783862cf5264d46dc22f2e.jpg",
      "description": "Sweet potato, a herbaceous perennial vine belonging to the Convolvulaceae family, is cherished for its versatile, edible storage roots or tubers. Native to Central America, this plant has now established itself across the globe. These robust vines, known for their heart-shaped lobed leaves and charming white or lavender flowers, can stretch up to 4m (13 ft) in a single growing season. Tubers come in a fascinating array of shapes and colors, from red, yellow, brown, and white to even purple.",
      "uses": "Sweet potato tubers are consumed raw as a vegetable or processed into flour or starch. The leaves can be eaten raw or cooked.",
      "basic_requirements": "Sweet potatoes thrive in warm, tropical climates with temperatures between 24-29°C (75-85°F). They require full sun and well-drained, sandy loam soil with a pH of 5.5-6.5. Sweet potatoes are drought-tolerant but require regular watering during dry spells. They are sensitive to frost and should be protected from temperatures below 10°C (50°F).",
      "care": "Sweet potatoes require regular watering to maintain growth and tuber development. The plants should be watered at the base to prevent the leaves from becoming wet which can lead to disease. The plants should be mulched to conserve soil moisture and suppress weeds. Sweet potatoes require regular fertilization to maintain growth and tuber production. The plants should be fertilized in the Spring with a balanced fertilizer and again in the Fall with a fertilizer high in potassium. The plants should be pruned to remove any dead or damaged canes and to promote growth. The plants should be pruned in the Spring before new growth begins. Sweet potato plants are susceptible to a number of pests and diseases and should be monitored regularly for signs of infestation.",
      "common_name:" : "Sweet potato (En)",
      "scientific_name": "Ipomoea batatas",
      "harvesting": "The harvesting season for sweet potato storage roots is not well defined; it varies depending on the cultivar, cultural practices, and climate. In tropical countries where sweet potatoes are grown for domestic consumption, 'progressive harvesting' (piece-meal harvesting) is common practice. To avoid weevil damage, it is generally recommended to harvest within 4 months. Manual harvesting with implements such as a stick, spade, or hoe is common in the tropics."
    }, {
      "title": "Tobacco",
      "description": "Tobacco, Nicotiana tabacum, is an herbaceous annual or perennial plant in the family Solanaceae grown for its leaves. The tobacco plant has a thick, hairy stem and large, simple leaves which are oval in shape. The tobacco plant produces white, cream, pink or red flowers which grow in large clusters, are tubular in appearance and can reach 3.5-5.5 cm (1,25-2 in) in length. Tobacco may reach 1.2-1.8 m (4-6 ft) in height and as is usually grown as an annual, surviving only one growing season. Tobacco may also be referred to as Virginia tobacco or cultivated tobacco and originates from South America.",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/4987/file/default-1eaa2d0e939a5cb6c8ff5f6a88f58d6e.jpg",
      "uses": " Tobacco is a stimulant and the dried leaves of the tobacco plant can be cured and used to produces tobacco cigarettes, cigars and snuff or for pesticide production.",
      "basic_requirements": "Tobacco grows very well in a wide range of climates and will grow optimally at temperatures between 20 and 30°C (68–86°F) in areas where there is a dry period to facilitate harvest of the leaves. The type of soil depends on the variety of tobacco being grown but the best yields are usually obtained in loam to sandy loam soils. The soil should have a pH between 5.0 and 6-6. Tobacco plants are easily damaged by waterlogged soils and quality can be affected by high salinity. Plants should therefore be grown in a well draining and well aerated soil. ",
      "care": "The best quality tobacco leaves are produced when the the flowerheads of the plants are removed, a process known as topping. Topping plants promotes the development of suckers which should also be removed. Suckers are removed through the use of chemicals in commercial tobacco production with some hand removal also necessary. Fertilizer and irrigation requirements of tobacco vary with the variety being grown but generally, tobacco has a requirement of 40-80 kg per hectare of nitrogen, 80-90 kg per hectare of phosphorous and 50-110 kg per hectare of potassium",
      "harvesting": "Tobacco is harvested by hand in most parts of the world by picking 2–3 leaves from each plant per harvest. In the USA and Canada, tobacco plants are mechanically harvested by cutting the stalks of the plants. Only fully mature leaves should be harvested when hand picking is practices and harvests should be carried out at weekly intervals. After harvest, leaves are usually tied in pairs to cure.",
      "common_name:" : "Tobacco (En)",
      "scientific_name": "Nicotiana tabacum"

    },
    {
      "title": "Vanilla",
      "description": "Vanilla, Vanilla planifolia, is a fleshy perennial vine in the family Orchidaceae grown for its pods and seeds which are used as a flavoring. The vanilla plant has a long succulent stem and grows by wrapping around trees. The vine has alternate, fleshy oblong or lanceolate leaves which are rounded at the base. The plant produces flowers on short racemes, each possessing 6–15 flowers, and fruits which take the form of narrow, cylindrical pods (or beans), each possessing many small black seeds. The vanilla plant can reach a height of 10–15 m (33–49 ft) in height and has an economic lifespan of approximately 10 years. The plant is native to Central America.",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/4997/file/default-f527ecea90124f36627705624e0e6f03.jpg",
      "uses": " Vanilla bean extract is used a flavoring in confectionery and baking. Essential oils extracted from the plant are also used in the perfume industry.",
      "basic_requirements": "Vanilla is a tropical plant and will grow best in warm, humid climates at temperatures between 21 and 32°C (33.8–89.6°F). Vanilla requires a soil rich in calcium and potassium and will grow best in a soil which is light and well-draining, with a pH between 6.0 and 7.0. Vanilla is a climbing plant and should always be provided with a support to grow on. It is usually planted alongside a companion tree, known as a tutor tree which has the added benefit of providing it with shade. Vanilla grows naturally in forests, often in clearings and alongside rivers and lakes where the forest canopy is thinner.",
      "care": " Vanilla should be managed to keep the vines at a manageable height as left unchecked they will continue to grow to the crowns of the supporting trees. When the plants reach a height of 1.6–1.8 m they should be bent back over the nearest suitable branch and the end of the shoot planted back into the ground and covered with soil. Planting the end of the shoot encourages the growth of roots and the continual production of newly rooted shoots helps to maintain a healthy plantation. Shoots may also be cut at the desired height and planted next to the same tutor tree once the wound has dried to create a new rooted plant. ",
      "harvesting": "Vanilla is ready for harvest between 6 and 9 months after flowering when the pods are still dark green and the tip is beginning to turn yellow.",
      "common_name:" : "Vanilla (En)",
      "scientific_name": "Vanilla planifolia"
    }, 
    {
      "title": "Wheat",
      "description": "Wheat, is the name given to several plants in the genus Triticum including Triticum aestivum, Triticum compactum, Triticum spelta and Triticum durum, which are annual or biennial grasses grown primarily for their grain. Wheat species possess an erect smooth stem with linear leaves that grow in two rows on either side of the stem with larger 'flag' leaves at the top of the stem. The stem terminates in a spike that is made up on individual spikelets, each possessing 3–9 florets. The wheat fruit develops within the spikelets, maturing to a seed (kernel). Wheat can reach 1.2 m (4 ft) in height and like other cereals, has been developed into different varieties that are adapted to planting at different times of the year. Spring wheat is planted for a late summer harvest, whereas Winter wheat is planted for harvesting in early to mid summer. Overwintering varieties are more commonly grown in regions with mild winters. Wheat may be referred to by variety and these include durum or macaroni wheat (Triticum durum), club wheat (Triticum compactum), spelt wheat (Triticum spelta) and bread wheat (Triticum aestivum). Wheat originated in the Fertile Crescent of the Middle East. ",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/2780/file/default-b66c2e5ce0f7aedac9b003d68a917b1e.jpg",
      "uses": "Wheat is one of the most important food plants in the world. It is used primarily to produce flour for bread. It is used widely in the production of many other baked goods. Wheat grain is also used in the manufacture of alcoholic beverages and alcohol. Wheat straw is used as an animal feed and in the manufacture of carpets, baskets, packing, bedding, and paper. ",
      "basic_requirements": " Wheat can be grown in a wide variety of climates but grows best in cool regions where the temperature is between 10 and 24°C (50–75°F). Wheat will not grow at temperatures above 35°C (95°F). Wheat will grow optimally in a deep, fertile, well draining and well aerated soil at a pH between 5.5 and 7.5.",
      "harvesting": "Wheat is ready to harvest when the stalks and heads have turned from green to yellow and the seed heads are drooping towards the ground. Check the seeds for ripeness before harvest. The should be firm and crunchy and not doughy in texture. Commercially produced wheat is usually harvested using a combine. Smaller plots can be harvested by hand using a scythe or sickle. Small plots can be harvested by snipping off the heads with a pair of scissors.",
      "care": "Wheat requires a well prepared seedbed and should be planted in rows to allow for mechanical cultivation. Wheat should be planted in the Fall and will be ready for harvest in the Spring or Summer. Wheat should be planted at a rate of 60–120 kg per hectare. Wheat should be fertilized with nitrogen, phosphorous and potassium. The amount of fertilizer required will depend on the soil type and the variety of wheat being grown. Wheat should be watered regularly to maintain growth and development. The plants should be watered at the base to prevent the leaves from becoming wet which can lead to disease. Wheat should be protected from pests and diseases. Wheat is susceptible to a number of pests and diseases and should be monitored regularly for signs of infestation. ",
      "common_name:" : "Wheat (En)",
      "scientific_name": "Triticum aestivum"

    }, {
      "title": "Watermelon",
      "description": "Watermelon, Citrullus lanatus, is a vining annual plant in the family Cucurbitaceae grown for its fleshy fruit. Watermelon vines are thin, grooved and covered in tiny hairs. Vines are branching and possess deeply lobed pinnate leaves. The plant produces solitary yellow flowers and and a large spherical to oblong fruit. The fruit is a 'pepo' - a fleshy fruit protected by a thick leathery rind. The fruit is smooth, light to dark green in color and can be striped, marbled or solid green. The flesh of the fruit is usually red in color but some cultivars produce green, orange or white flesh and contains numerous seeds which are usually black or dark brown in color. Watermelon vines can reach a length of 3 m (10 ft) and as an annual, survives only one growing season. Watermelon originates from Africa.",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/2305/file/default-9d9e83ca5867dce6e4780ac6bc90fb4e.jpg",
      "uses": " Watermelon is usually consumed as a fresh fruit. In Africa it is sometimes cooked before eating and may also be used as an animal feed.",
      "basic_requirements": "Watermelon is a warm-season crop, requiring lots of sun and good drainage to develop optimally and growing best at temperatures between 18 and 28°C (65–82°F). Watermelon will yield best if grown in a light, well-draining soil, rich in organic matter and with a pH between 6.0 and 7.0. Watermelon should be planted in full sun and heavy feeders. They need to be provided with even soil moisture and fertilized regularly. Vining varieties can grow to very large sizes and require a good deal of space. ",
      "care": "Watermelon vines are sprawling and require plenty space to grow. Vines can be trained to grow on a trellis or fence to save space. Watermelon plants Watermelons have a very deep root system which allows them to access soil moisture efficiently. However, if conditions are very dry for prolonged periods then additional water should be provided.. Plastic mulches are highly recommended in areas where conditions are not ideal for growth as they conserve soil moisture and black polyethylene has the advantage of warming the soil. Floating row covers can be beneficial while the plants establish to protect against insect pests.",
      "harvesting":"Watermelons are ready to be harvested when the the tendrils closest to the fruit are beginning to dry out and turn brown. The underside of the melon should be beginning to turn yellow",
      "common_name:" : "Watermelon (En)",
      "scientific_name": "Citrullus lanatus"
    }, {
      "title": "Yams",
      "description": "Yam is the name given to several plant species in the genus Dioscorea including Dioscorea alata (white yam), Dioscorea bulbifera (potato yam), Dioscorea cayenensis (yellow yam), Dioscorea esculenta (Asiatic yam) and Dioscorea batatas (Chinese yam) that are grown for their edible tubers. These species are not to be confused with the sweet potato, Ipomoea batatas, which is often referred to as a yam in the US. Yam plants are herbaceous annual or perennials with climbing or trailing vines. The vines can be smooth or prickly, reaching 10 m (32.8 ft) or more in length depending on the variety. The leaves of the plant are simple and usually oval to heart-shaped with petioles which are the same length, or slightly longer, than the leaf blade itself. Some varieties possess spikes at the bases of the leaves. ",
      "image": "https://plantvillage-production-new.s3.amazonaws.com/image/304/file/default-0ce106ec8ae33e1c3873cccdbcb814c4.jpg",
      "uses": " Yams are used differently in different parts of the world. They are consumed after cooking by frying, boiling or roasting. The green parts of some plants can be cooked and consumed as a vegetable. Yams may also be used to produce flour or starch.",
      "basic_requirements": " Yams are mainly grown in tropical and subtropical climates and they do not grow well at temperatures below 22°C (71.6°F) and are killed by frost.. The optimum temperature for the growth of yams is between 25 and 30°C (77–86°F). They grow optimally in well-draining fertile soils with a pH between 5.5 and 6.5 in full sun or part shade. Very wet soils should be avoided as this promotes tuber rot. ",
      "care": "Yams require 100 cm of water distributed evenly throughout the growing season. Yam plants should be mulched after planting to prevent plants from drying out. Failure to mulch the plants will result in drastic decreases in yield. ",
      "harvesting": "Yams can be harvested at any time after the leaves have started to yellow. The soil should be carefully dug around the tuber and the the tuber cut from the vine. Harvesting is best carried out on sunny, dry days to prevent tuber rot.",
      "common_name:" : "Yam (En)",
      "scientific_name": "Dioscorea spp."

    }
]